GopalSaraf/Practicals/PSDL/include/proc/pic16lf1776.inc
// Register: CM2NSEL
#define CM2NSEL CM2NSEL
CM2NSEL                                  equ 0118h
// bitfield definitions
CM2NSEL_NCH_POSN                         equ 0000h
CM2NSEL_NCH_POSITION                     equ 0000h
CM2NSEL_NCH_SIZE                         equ 0004h
CM2NSEL_NCH_LENGTH                       equ 0004h
CM2NSEL_NCH_MASK                         equ 000Fh
CM2NSEL_C2NCH_POSN                       equ 0000h
CM2NSEL_C2NCH_POSITION                   equ 0000h
CM2NSEL_C2NCH_SIZE                       equ 0004h
CM2NSEL_C2NCH_LENGTH                     equ 0004h
CM2NSEL_C2NCH_MASK                       equ 000Fh
CM2NSEL_C2NCH0_POSN                      equ 0000h
CM2NSEL_C2NCH0_POSITION                  equ 0000h
CM2NSEL_C2NCH0_SIZE                      equ 0001h
CM2NSEL_C2NCH0_LENGTH                    equ 0001h
CM2NSEL_C2NCH0_MASK                      equ 0001h
CM2NSEL_C2NCH1_POSN                      equ 0001h
CM2NSEL_C2NCH1_POSITION                  equ 0001h
CM2NSEL_C2NCH1_SIZE                      equ 0001h
CM2NSEL_C2NCH1_LENGTH                    equ 0001h
CM2NSEL_C2NCH1_MASK                      equ 0002h
CM2NSEL_C2NCH2_POSN                      equ 0002h
CM2NSEL_C2NCH2_POSITION                  equ 0002h
CM2NSEL_C2NCH2_SIZE                      equ 0001h
CM2NSEL_C2NCH2_LENGTH                    equ 0001h
CM2NSEL_C2NCH2_MASK                      equ 0004h
CM2NSEL_C2NCH3_POSN                      equ 0003h
CM2NSEL_C2NCH3_POSITION                  equ 0003h
CM2NSEL_C2NCH3_SIZE                      equ 0001h
CM2NSEL_C2NCH3_LENGTH                    equ 0001h
CM2NSEL_C2NCH3_MASK                      equ 0008h

// Register: CM2PSEL
#define CM2PSEL CM2PSEL
CM2PSEL                                  equ 0119h
// bitfield definitions
CM2PSEL_PCH_POSN                         equ 0000h
CM2PSEL_PCH_POSITION                     equ 0000h
CM2PSEL_PCH_SIZE                         equ 0004h
CM2PSEL_PCH_LENGTH                       equ 0004h
CM2PSEL_PCH_MASK                         equ 000Fh
CM2PSEL_PCH0_POSN                        equ 0000h
CM2PSEL_PCH0_POSITION                    equ 0000h
CM2PSEL_PCH0_SIZE                        equ 0001h
CM2PSEL_PCH0_LENGTH                      equ 0001h
CM2PSEL_PCH0_MASK                        equ 0001h
CM2PSEL_PCH1_POSN                        equ 0001h
CM2PSEL_PCH1_POSITION                    equ 0001h
CM2PSEL_PCH1_SIZE                        equ 0001h
CM2PSEL_PCH1_LENGTH                      equ 0001h
CM2PSEL_PCH1_MASK                        equ 0002h
CM2PSEL_PCH2_POSN                        equ 0002h
CM2PSEL_PCH2_POSITION                    equ 0002h
CM2PSEL_PCH2_SIZE                        equ 0001h
CM2PSEL_PCH2_LENGTH                      equ 0001h
CM2PSEL_PCH2_MASK                        equ 0004h
CM2PSEL_PCH3_POSN                        equ 0003h
CM2PSEL_PCH3_POSITION                    equ 0003h
CM2PSEL_PCH3_SIZE                        equ 0001h
CM2PSEL_PCH3_LENGTH                      equ 0001h
CM2PSEL_PCH3_MASK                        equ 0008h
CM2PSEL_C2PCH_POSN                       equ 0000h
CM2PSEL_C2PCH_POSITION                   equ 0000h
CM2PSEL_C2PCH_SIZE                       equ 0004h
CM2PSEL_C2PCH_LENGTH                     equ 0004h
CM2PSEL_C2PCH_MASK                       equ 000Fh
CM2PSEL_C2PCH0_POSN                      equ 0000h
CM2PSEL_C2PCH0_POSITION                  equ 0000h
CM2PSEL_C2PCH0_SIZE                      equ 0001h
CM2PSEL_C2PCH0_LENGTH                    equ 0001h
CM2PSEL_C2PCH0_MASK                      equ 0001h
CM2PSEL_C2PCH1_POSN                      equ 0001h
CM2PSEL_C2PCH1_POSITION                  equ 0001h
CM2PSEL_C2PCH1_SIZE                      equ 0001h
CM2PSEL_C2PCH1_LENGTH                    equ 0001h
CM2PSEL_C2PCH1_MASK                      equ 0002h
CM2PSEL_C2PCH2_POSN                      equ 0002h
CM2PSEL_C2PCH2_POSITION                  equ 0002h
CM2PSEL_C2PCH2_SIZE                      equ 0001h
CM2PSEL_C2PCH2_LENGTH                    equ 0001h
CM2PSEL_C2PCH2_MASK                      equ 0004h
CM2PSEL_C2PCH3_POSN                      equ 0003h
CM2PSEL_C2PCH3_POSITION                  equ 0003h
CM2PSEL_C2PCH3_SIZE                      equ 0001h
CM2PSEL_C2PCH3_LENGTH                    equ 0001h
CM2PSEL_C2PCH3_MASK                      equ 0008h

// Register: CM3CON0
#define CM3CON0 CM3CON0
CM3CON0                                  equ 011Ah
// bitfield definitions
CM3CON0_SYNC_POSN                        equ 0000h
CM3CON0_SYNC_POSITION                    equ 0000h
CM3CON0_SYNC_SIZE                        equ 0001h
CM3CON0_SYNC_LENGTH                      equ 0001h
CM3CON0_SYNC_MASK                        equ 0001h
CM3CON0_HYS_POSN                         equ 0001h
CM3CON0_HYS_POSITION                     equ 0001h
CM3CON0_HYS_SIZE                         equ 0001h
CM3CON0_HYS_LENGTH                       equ 0001h
CM3CON0_HYS_MASK                         equ 0002h
CM3CON0_ZLF_POSN                         equ 0003h
CM3CON0_ZLF_POSITION                     equ 0003h
CM3CON0_ZLF_SIZE                         equ 0001h
CM3CON0_ZLF_LENGTH                       equ 0001h
CM3CON0_ZLF_MASK                         equ 0008h
CM3CON0_POL_POSN                         equ 0004h
CM3CON0_POL_POSITION                     equ 0004h
CM3CON0_POL_SIZE                         equ 0001h
CM3CON0_POL_LENGTH                       equ 0001h
CM3CON0_POL_MASK                         equ 0010h
CM3CON0_OUT_POSN                         equ 0006h
CM3CON0_OUT_POSITION                     equ 0006h
CM3CON0_OUT_SIZE                         equ 0001h
CM3CON0_OUT_LENGTH                       equ 0001h
CM3CON0_OUT_MASK                         equ 0040h
CM3CON0_ON_POSN                          equ 0007h
CM3CON0_ON_POSITION                      equ 0007h
CM3CON0_ON_SIZE                          equ 0001h
CM3CON0_ON_LENGTH                        equ 0001h
CM3CON0_ON_MASK                          equ 0080h
CM3CON0_C3SYNC_POSN                      equ 0000h
CM3CON0_C3SYNC_POSITION                  equ 0000h
CM3CON0_C3SYNC_SIZE                      equ 0001h
CM3CON0_C3SYNC_LENGTH                    equ 0001h
CM3CON0_C3SYNC_MASK                      equ 0001h
CM3CON0_C3HYS_POSN                       equ 0001h
CM3CON0_C3HYS_POSITION                   equ 0001h
CM3CON0_C3HYS_SIZE                       equ 0001h
CM3CON0_C3HYS_LENGTH                     equ 0001h
CM3CON0_C3HYS_MASK                       equ 0002h
CM3CON0_C3SP_POSN                        equ 0002h
CM3CON0_C3SP_POSITION                    equ 0002h
CM3CON0_C3SP_SIZE                        equ 0001h
CM3CON0_C3SP_LENGTH                      equ 0001h
CM3CON0_C3SP_MASK                        equ 0004h
CM3CON0_C3ZLF_POSN                       equ 0003h
CM3CON0_C3ZLF_POSITION                   equ 0003h
CM3CON0_C3ZLF_SIZE                       equ 0001h
CM3CON0_C3ZLF_LENGTH                     equ 0001h
CM3CON0_C3ZLF_MASK                       equ 0008h
CM3CON0_C3POL_POSN                       equ 0004h
CM3CON0_C3POL_POSITION                   equ 0004h
CM3CON0_C3POL_SIZE                       equ 0001h
CM3CON0_C3POL_LENGTH                     equ 0001h
CM3CON0_C3POL_MASK                       equ 0010h
CM3CON0_C3OUT_POSN                       equ 0006h
CM3CON0_C3OUT_POSITION                   equ 0006h
CM3CON0_C3OUT_SIZE                       equ 0001h
CM3CON0_C3OUT_LENGTH                     equ 0001h
CM3CON0_C3OUT_MASK                       equ 0040h
CM3CON0_C3ON_POSN                        equ 0007h
CM3CON0_C3ON_POSITION                    equ 0007h
CM3CON0_C3ON_SIZE                        equ 0001h
CM3CON0_C3ON_LENGTH                      equ 0001h
CM3CON0_C3ON_MASK                        equ 0080h

// Register: CM3CON1
#define CM3CON1 CM3CON1
CM3CON1                                  equ 011Bh
// bitfield definitions
CM3CON1_INTN_POSN                        equ 0000h
CM3CON1_INTN_POSITION                    equ 0000h
CM3CON1_INTN_SIZE                        equ 0001h
CM3CON1_INTN_LENGTH                      equ 0001h
CM3CON1_INTN_MASK                        equ 0001h
CM3CON1_INTP_POSN                        equ 0001h
CM3CON1_INTP_POSITION                    equ 0001h
CM3CON1_INTP_SIZE                        equ 0001h
CM3CON1_INTP_LENGTH                      equ 0001h
CM3CON1_INTP_MASK                        equ 0002h
CM3CON1_C3INTN_POSN                      equ 0000h
CM3CON1_C3INTN_POSITION                  equ 0000h
CM3CON1_C3INTN_SIZE                      equ 0001h
CM3CON1_C3INTN_LENGTH                    equ 0001h
CM3CON1_C3INTN_MASK                      equ 0001h
CM3CON1_C3INTP_POSN                      equ 0001h
CM3CON1_C3INTP_POSITION                  equ 0001h
CM3CON1_C3INTP_SIZE                      equ 0001h
CM3CON1_C3INTP_LENGTH                    equ 0001h
CM3CON1_C3INTP_MASK                      equ 0002h

// Register: CM3NSEL
#define CM3NSEL CM3NSEL
CM3NSEL                                  equ 011Ch
// bitfield definitions
CM3NSEL_NCH_POSN                         equ 0000h
CM3NSEL_NCH_POSITION                     equ 0000h
CM3NSEL_NCH_SIZE                         equ 0004h
CM3NSEL_NCH_LENGTH                       equ 0004h
CM3NSEL_NCH_MASK                         equ 000Fh
CM3NSEL_C3NCH_POSN                       equ 0000h
CM3NSEL_C3NCH_POSITION                   equ 0000h
CM3NSEL_C3NCH_SIZE                       equ 0004h
CM3NSEL_C3NCH_LENGTH                     equ 0004h
CM3NSEL_C3NCH_MASK                       equ 000Fh
CM3NSEL_C3NCH0_POSN                      equ 0000h
CM3NSEL_C3NCH0_POSITION                  equ 0000h
CM3NSEL_C3NCH0_SIZE                      equ 0001h
CM3NSEL_C3NCH0_LENGTH                    equ 0001h
CM3NSEL_C3NCH0_MASK                      equ 0001h
CM3NSEL_C3NCH1_POSN                      equ 0001h
CM3NSEL_C3NCH1_POSITION                  equ 0001h
CM3NSEL_C3NCH1_SIZE                      equ 0001h
CM3NSEL_C3NCH1_LENGTH                    equ 0001h
CM3NSEL_C3NCH1_MASK                      equ 0002h
CM3NSEL_C3NCH2_POSN                      equ 0002h
CM3NSEL_C3NCH2_POSITION                  equ 0002h
CM3NSEL_C3NCH2_SIZE                      equ 0001h
CM3NSEL_C3NCH2_LENGTH                    equ 0001h
CM3NSEL_C3NCH2_MASK                      equ 0004h
CM3NSEL_C3NCH3_POSN                      equ 0003h
CM3NSEL_C3NCH3_POSITION                  equ 0003h
CM3NSEL_C3NCH3_SIZE                      equ 0001h
CM3NSEL_C3NCH3_LENGTH                    equ 0001h
CM3NSEL_C3NCH3_MASK                      equ 0008h

// Register: CM3PSEL
#define CM3PSEL CM3PSEL
CM3PSEL                                  equ 011Dh
// bitfield definitions
CM3PSEL_PCH_POSN                         equ 0000h
CM3PSEL_PCH_POSITION                     equ 0000h
CM3PSEL_PCH_SIZE                         equ 0004h
CM3PSEL_PCH_LENGTH                       equ 0004h
CM3PSEL_PCH_MASK                         equ 000Fh
CM3PSEL_PCH0_POSN                        equ 0000h
CM3PSEL_PCH0_POSITION                    equ 0000h
CM3PSEL_PCH0_SIZE                        equ 0001h
CM3PSEL_PCH0_LENGTH                      equ 0001h
CM3PSEL_PCH0_MASK                        equ 0001h
CM3PSEL_PCH1_POSN                        equ 0001h
CM3PSEL_PCH1_POSITION                    equ 0001h
CM3PSEL_PCH1_SIZE                        equ 0001h
CM3PSEL_PCH1_LENGTH                      equ 0001h
CM3PSEL_PCH1_MASK                        equ 0002h
CM3PSEL_PCH2_POSN                        equ 0002h
CM3PSEL_PCH2_POSITION                    equ 0002h
CM3PSEL_PCH2_SIZE                        equ 0001h
CM3PSEL_PCH2_LENGTH                      equ 0001h
CM3PSEL_PCH2_MASK                        equ 0004h
CM3PSEL_PCH3_POSN                        equ 0003h
CM3PSEL_PCH3_POSITION                    equ 0003h
CM3PSEL_PCH3_SIZE                        equ 0001h
CM3PSEL_PCH3_LENGTH                      equ 0001h
CM3PSEL_PCH3_MASK                        equ 0008h
CM3PSEL_C3PCH_POSN                       equ 0000h
CM3PSEL_C3PCH_POSITION                   equ 0000h
CM3PSEL_C3PCH_SIZE                       equ 0004h
CM3PSEL_C3PCH_LENGTH                     equ 0004h
CM3PSEL_C3PCH_MASK                       equ 000Fh
CM3PSEL_C3PCH0_POSN                      equ 0000h
CM3PSEL_C3PCH0_POSITION                  equ 0000h
CM3PSEL_C3PCH0_SIZE                      equ 0001h
CM3PSEL_C3PCH0_LENGTH                    equ 0001h
CM3PSEL_C3PCH0_MASK                      equ 0001h
CM3PSEL_C3PCH1_POSN                      equ 0001h
CM3PSEL_C3PCH1_POSITION                  equ 0001h
CM3PSEL_C3PCH1_SIZE                      equ 0001h
CM3PSEL_C3PCH1_LENGTH                    equ 0001h
CM3PSEL_C3PCH1_MASK                      equ 0002h
CM3PSEL_C3PCH2_POSN                      equ 0002h
CM3PSEL_C3PCH2_POSITION                  equ 0002h
CM3PSEL_C3PCH2_SIZE                      equ 0001h
CM3PSEL_C3PCH2_LENGTH                    equ 0001h
CM3PSEL_C3PCH2_MASK                      equ 0004h
CM3PSEL_C3PCH3_POSN                      equ 0003h
CM3PSEL_C3PCH3_POSITION                  equ 0003h
CM3PSEL_C3PCH3_SIZE                      equ 0001h
CM3PSEL_C3PCH3_LENGTH                    equ 0001h
CM3PSEL_C3PCH3_MASK                      equ 0008h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 018Ch
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA3_POSN                        equ 0003h
ANSELA_ANSA3_POSITION                    equ 0003h
ANSELA_ANSA3_SIZE                        equ 0001h
ANSELA_ANSA3_LENGTH                      equ 0001h
ANSELA_ANSA3_MASK                        equ 0008h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA5_POSN                        equ 0005h
ANSELA_ANSA5_POSITION                    equ 0005h
ANSELA_ANSA5_SIZE                        equ 0001h
ANSELA_ANSA5_LENGTH                      equ 0001h
ANSELA_ANSA5_MASK                        equ 0020h

// Register: ANSELB
#define ANSELB ANSELB
ANSELB                                   equ 018Dh
// bitfield definitions
ANSELB_ANSB0_POSN                        equ 0000h
ANSELB_ANSB0_POSITION                    equ 0000h
ANSELB_ANSB0_SIZE                        equ 0001h
ANSELB_ANSB0_LENGTH                      equ 0001h
ANSELB_ANSB0_MASK                        equ 0001h
ANSELB_ANSB1_POSN                        equ 0001h
ANSELB_ANSB1_POSITION                    equ 0001h
ANSELB_ANSB1_SIZE                        equ 0001h
ANSELB_ANSB1_LENGTH                      equ 0001h
ANSELB_ANSB1_MASK                        equ 0002h
ANSELB_ANSB2_POSN                        equ 0002h
ANSELB_ANSB2_POSITION                    equ 0002h
ANSELB_ANSB2_SIZE                        equ 0001h
ANSELB_ANSB2_LENGTH                      equ 0001h
ANSELB_ANSB2_MASK                        equ 0004h
ANSELB_ANSB3_POSN                        equ 0003h
ANSELB_ANSB3_POSITION                    equ 0003h
ANSELB_ANSB3_SIZE                        equ 0001h
ANSELB_ANSB3_LENGTH                      equ 0001h
ANSELB_ANSB3_MASK                        equ 0008h
ANSELB_ANSB4_POSN                        equ 0004h
ANSELB_ANSB4_POSITION                    equ 0004h
ANSELB_ANSB4_SIZE                        equ 0001h
ANSELB_ANSB4_LENGTH                      equ 0001h
ANSELB_ANSB4_MASK                        equ 0010h
ANSELB_ANSB5_POSN                        equ 0005h
ANSELB_ANSB5_POSITION                    equ 0005h
ANSELB_ANSB5_SIZE                        equ 0001h
ANSELB_ANSB5_LENGTH                      equ 0001h
ANSELB_ANSB5_MASK                        equ 0020h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 018Eh
// bitfield definitions
ANSELC_ANSC2_POSN                        equ 0002h
ANSELC_ANSC2_POSITION                    equ 0002h
ANSELC_ANSC2_SIZE                        equ 0001h
ANSELC_ANSC2_LENGTH                      equ 0001h
ANSELC_ANSC2_MASK                        equ 0004h
ANSELC_ANSC3_POSN                        equ 0003h
ANSELC_ANSC3_POSITION                    equ 0003h
ANSELC_ANSC3_SIZE                        equ 0001h
ANSELC_ANSC3_LENGTH                      equ 0001h
ANSELC_ANSC3_MASK                        equ 0008h
ANSELC_ANSC4_POSN                        equ 0004h
ANSELC_ANSC4_POSITION                    equ 0004h
ANSELC_ANSC4_SIZE                        equ 0001h
ANSELC_ANSC4_LENGTH                      equ 0001h
ANSELC_ANSC4_MASK                        equ 0010h
ANSELC_ANSC5_POSN                        equ 0005h
ANSELC_ANSC5_POSITION                    equ 0005h
ANSELC_ANSC5_SIZE                        equ 0001h
ANSELC_ANSC5_LENGTH                      equ 0001h
ANSELC_ANSC5_MASK                        equ 0020h
ANSELC_ANSC6_POSN                        equ 0006h
ANSELC_ANSC6_POSITION                    equ 0006h
ANSELC_ANSC6_SIZE                        equ 0001h
ANSELC_ANSC6_LENGTH                      equ 0001h
ANSELC_ANSC6_MASK                        equ 0040h
ANSELC_ANSC7_POSN                        equ 0007h
ANSELC_ANSC7_POSITION                    equ 0007h
ANSELC_ANSC7_SIZE                        equ 0001h
ANSELC_ANSC7_LENGTH                      equ 0001h
ANSELC_ANSC7_MASK                        equ 0080h

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 0191h
// bitfield definitions
PMADRL_PMADRL_POSN                       equ 0000h
PMADRL_PMADRL_POSITION                   equ 0000h
PMADRL_PMADRL_SIZE                       equ 0008h
PMADRL_PMADRL_LENGTH                     equ 0008h
PMADRL_PMADRL_MASK                       equ 00FFh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 0192h
// bitfield definitions
PMADRH_PMADRH_POSN                       equ 0000h
PMADRH_PMADRH_POSITION                   equ 0000h
PMADRH_PMADRH_SIZE                       equ 0007h
PMADRH_PMADRH_LENGTH                     equ 0007h
PMADRH_PMADRH_MASK                       equ 007Fh

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 0193h
// bitfield definitions
PMDATL_PMDATL_POSN                       equ 0000h
PMDATL_PMDATL_POSITION                   equ 0000h
PMDATL_PMDATL_SIZE                       equ 0008h
PMDATL_PMDATL_LENGTH                     equ 0008h
PMDATL_PMDATL_MASK                       equ 00FFh

