GopalSaraf/Practicals/PSDL/include/proc/pic16lf1776.inc
// Register: MD2CON1
#define MD2CON1 MD2CON1
MD2CON1                                  equ 031Ch
// bitfield definitions
MD2CON1_CLSYNC_POSN                      equ 0000h
MD2CON1_CLSYNC_POSITION                  equ 0000h
MD2CON1_CLSYNC_SIZE                      equ 0001h
MD2CON1_CLSYNC_LENGTH                    equ 0001h
MD2CON1_CLSYNC_MASK                      equ 0001h
MD2CON1_CLPOL_POSN                       equ 0001h
MD2CON1_CLPOL_POSITION                   equ 0001h
MD2CON1_CLPOL_SIZE                       equ 0001h
MD2CON1_CLPOL_LENGTH                     equ 0001h
MD2CON1_CLPOL_MASK                       equ 0002h
MD2CON1_CHSYNC_POSN                      equ 0004h
MD2CON1_CHSYNC_POSITION                  equ 0004h
MD2CON1_CHSYNC_SIZE                      equ 0001h
MD2CON1_CHSYNC_LENGTH                    equ 0001h
MD2CON1_CHSYNC_MASK                      equ 0010h
MD2CON1_CHPOL_POSN                       equ 0005h
MD2CON1_CHPOL_POSITION                   equ 0005h
MD2CON1_CHPOL_SIZE                       equ 0001h
MD2CON1_CHPOL_LENGTH                     equ 0001h
MD2CON1_CHPOL_MASK                       equ 0020h
MD2CON1_MD2CLSYNC_POSN                   equ 0000h
MD2CON1_MD2CLSYNC_POSITION               equ 0000h
MD2CON1_MD2CLSYNC_SIZE                   equ 0001h
MD2CON1_MD2CLSYNC_LENGTH                 equ 0001h
MD2CON1_MD2CLSYNC_MASK                   equ 0001h
MD2CON1_MD2CLPOL_POSN                    equ 0001h
MD2CON1_MD2CLPOL_POSITION                equ 0001h
MD2CON1_MD2CLPOL_SIZE                    equ 0001h
MD2CON1_MD2CLPOL_LENGTH                  equ 0001h
MD2CON1_MD2CLPOL_MASK                    equ 0002h
MD2CON1_MD2CHSYNC_POSN                   equ 0004h
MD2CON1_MD2CHSYNC_POSITION               equ 0004h
MD2CON1_MD2CHSYNC_SIZE                   equ 0001h
MD2CON1_MD2CHSYNC_LENGTH                 equ 0001h
MD2CON1_MD2CHSYNC_MASK                   equ 0010h
MD2CON1_MD2CHPOL_POSN                    equ 0005h
MD2CON1_MD2CHPOL_POSITION                equ 0005h
MD2CON1_MD2CHPOL_SIZE                    equ 0001h
MD2CON1_MD2CHPOL_LENGTH                  equ 0001h
MD2CON1_MD2CHPOL_MASK                    equ 0020h

// Register: MD2SRC
#define MD2SRC MD2SRC
MD2SRC                                   equ 031Dh
// bitfield definitions
MD2SRC_MS_POSN                           equ 0000h
MD2SRC_MS_POSITION                       equ 0000h
MD2SRC_MS_SIZE                           equ 0005h
MD2SRC_MS_LENGTH                         equ 0005h
MD2SRC_MS_MASK                           equ 001Fh
MD2SRC_MS0_POSN                          equ 0000h
MD2SRC_MS0_POSITION                      equ 0000h
MD2SRC_MS0_SIZE                          equ 0001h
MD2SRC_MS0_LENGTH                        equ 0001h
MD2SRC_MS0_MASK                          equ 0001h
MD2SRC_MS1_POSN                          equ 0001h
MD2SRC_MS1_POSITION                      equ 0001h
MD2SRC_MS1_SIZE                          equ 0001h
MD2SRC_MS1_LENGTH                        equ 0001h
MD2SRC_MS1_MASK                          equ 0002h
MD2SRC_MS2_POSN                          equ 0002h
MD2SRC_MS2_POSITION                      equ 0002h
MD2SRC_MS2_SIZE                          equ 0001h
MD2SRC_MS2_LENGTH                        equ 0001h
MD2SRC_MS2_MASK                          equ 0004h
MD2SRC_MS3_POSN                          equ 0003h
MD2SRC_MS3_POSITION                      equ 0003h
MD2SRC_MS3_SIZE                          equ 0001h
MD2SRC_MS3_LENGTH                        equ 0001h
MD2SRC_MS3_MASK                          equ 0008h
MD2SRC_MS4_POSN                          equ 0004h
MD2SRC_MS4_POSITION                      equ 0004h
MD2SRC_MS4_SIZE                          equ 0001h
MD2SRC_MS4_LENGTH                        equ 0001h
MD2SRC_MS4_MASK                          equ 0010h
MD2SRC_MD2MS_POSN                        equ 0000h
MD2SRC_MD2MS_POSITION                    equ 0000h
MD2SRC_MD2MS_SIZE                        equ 0005h
MD2SRC_MD2MS_LENGTH                      equ 0005h
MD2SRC_MD2MS_MASK                        equ 001Fh
MD2SRC_MD2MS0_POSN                       equ 0000h
MD2SRC_MD2MS0_POSITION                   equ 0000h
MD2SRC_MD2MS0_SIZE                       equ 0001h
MD2SRC_MD2MS0_LENGTH                     equ 0001h
MD2SRC_MD2MS0_MASK                       equ 0001h
MD2SRC_MD2MS1_POSN                       equ 0001h
MD2SRC_MD2MS1_POSITION                   equ 0001h
MD2SRC_MD2MS1_SIZE                       equ 0001h
MD2SRC_MD2MS1_LENGTH                     equ 0001h
MD2SRC_MD2MS1_MASK                       equ 0002h
MD2SRC_MD2MS2_POSN                       equ 0002h
MD2SRC_MD2MS2_POSITION                   equ 0002h
MD2SRC_MD2MS2_SIZE                       equ 0001h
MD2SRC_MD2MS2_LENGTH                     equ 0001h
MD2SRC_MD2MS2_MASK                       equ 0004h
MD2SRC_MD2MS3_POSN                       equ 0003h
MD2SRC_MD2MS3_POSITION                   equ 0003h
MD2SRC_MD2MS3_SIZE                       equ 0001h
MD2SRC_MD2MS3_LENGTH                     equ 0001h
MD2SRC_MD2MS3_MASK                       equ 0008h
MD2SRC_MD2MS4_POSN                       equ 0004h
MD2SRC_MD2MS4_POSITION                   equ 0004h
MD2SRC_MD2MS4_SIZE                       equ 0001h
MD2SRC_MD2MS4_LENGTH                     equ 0001h
MD2SRC_MD2MS4_MASK                       equ 0010h

// Register: MD2CARL
#define MD2CARL MD2CARL
MD2CARL                                  equ 031Eh
// bitfield definitions
MD2CARL_CL_POSN                          equ 0000h
MD2CARL_CL_POSITION                      equ 0000h
MD2CARL_CL_SIZE                          equ 0005h
MD2CARL_CL_LENGTH                        equ 0005h
MD2CARL_CL_MASK                          equ 001Fh
MD2CARL_CL0_POSN                         equ 0000h
MD2CARL_CL0_POSITION                     equ 0000h
MD2CARL_CL0_SIZE                         equ 0001h
MD2CARL_CL0_LENGTH                       equ 0001h
MD2CARL_CL0_MASK                         equ 0001h
MD2CARL_CL1_POSN                         equ 0001h
MD2CARL_CL1_POSITION                     equ 0001h
MD2CARL_CL1_SIZE                         equ 0001h
MD2CARL_CL1_LENGTH                       equ 0001h
MD2CARL_CL1_MASK                         equ 0002h
MD2CARL_CL2_POSN                         equ 0002h
MD2CARL_CL2_POSITION                     equ 0002h
MD2CARL_CL2_SIZE                         equ 0001h
MD2CARL_CL2_LENGTH                       equ 0001h
MD2CARL_CL2_MASK                         equ 0004h
MD2CARL_CL3_POSN                         equ 0003h
MD2CARL_CL3_POSITION                     equ 0003h
MD2CARL_CL3_SIZE                         equ 0001h
MD2CARL_CL3_LENGTH                       equ 0001h
MD2CARL_CL3_MASK                         equ 0008h
MD2CARL_CL4_POSN                         equ 0004h
MD2CARL_CL4_POSITION                     equ 0004h
MD2CARL_CL4_SIZE                         equ 0001h
MD2CARL_CL4_LENGTH                       equ 0001h
MD2CARL_CL4_MASK                         equ 0010h
MD2CARL_MD2CL_POSN                       equ 0000h
MD2CARL_MD2CL_POSITION                   equ 0000h
MD2CARL_MD2CL_SIZE                       equ 0005h
MD2CARL_MD2CL_LENGTH                     equ 0005h
MD2CARL_MD2CL_MASK                       equ 001Fh
MD2CARL_MD2CL0_POSN                      equ 0000h
MD2CARL_MD2CL0_POSITION                  equ 0000h
MD2CARL_MD2CL0_SIZE                      equ 0001h
MD2CARL_MD2CL0_LENGTH                    equ 0001h
MD2CARL_MD2CL0_MASK                      equ 0001h
MD2CARL_MD2CL1_POSN                      equ 0001h
MD2CARL_MD2CL1_POSITION                  equ 0001h
MD2CARL_MD2CL1_SIZE                      equ 0001h
MD2CARL_MD2CL1_LENGTH                    equ 0001h
MD2CARL_MD2CL1_MASK                      equ 0002h
MD2CARL_MD2CL2_POSN                      equ 0002h
MD2CARL_MD2CL2_POSITION                  equ 0002h
MD2CARL_MD2CL2_SIZE                      equ 0001h
MD2CARL_MD2CL2_LENGTH                    equ 0001h
MD2CARL_MD2CL2_MASK                      equ 0004h
MD2CARL_MD2CL3_POSN                      equ 0003h
MD2CARL_MD2CL3_POSITION                  equ 0003h
MD2CARL_MD2CL3_SIZE                      equ 0001h
MD2CARL_MD2CL3_LENGTH                    equ 0001h
MD2CARL_MD2CL3_MASK                      equ 0008h
MD2CARL_MD2CL4_POSN                      equ 0004h
MD2CARL_MD2CL4_POSITION                  equ 0004h
MD2CARL_MD2CL4_SIZE                      equ 0001h
MD2CARL_MD2CL4_LENGTH                    equ 0001h
MD2CARL_MD2CL4_MASK                      equ 0010h

// Register: MD2CARH
#define MD2CARH MD2CARH
MD2CARH                                  equ 031Fh
// bitfield definitions
MD2CARH_CH_POSN                          equ 0000h
MD2CARH_CH_POSITION                      equ 0000h
MD2CARH_CH_SIZE                          equ 0005h
MD2CARH_CH_LENGTH                        equ 0005h
MD2CARH_CH_MASK                          equ 001Fh
MD2CARH_CH0_POSN                         equ 0000h
MD2CARH_CH0_POSITION                     equ 0000h
MD2CARH_CH0_SIZE                         equ 0001h
MD2CARH_CH0_LENGTH                       equ 0001h
MD2CARH_CH0_MASK                         equ 0001h
MD2CARH_CH1_POSN                         equ 0001h
MD2CARH_CH1_POSITION                     equ 0001h
MD2CARH_CH1_SIZE                         equ 0001h
MD2CARH_CH1_LENGTH                       equ 0001h
MD2CARH_CH1_MASK                         equ 0002h
MD2CARH_CH2_POSN                         equ 0002h
MD2CARH_CH2_POSITION                     equ 0002h
MD2CARH_CH2_SIZE                         equ 0001h
MD2CARH_CH2_LENGTH                       equ 0001h
MD2CARH_CH2_MASK                         equ 0004h
MD2CARH_CH3_POSN                         equ 0003h
MD2CARH_CH3_POSITION                     equ 0003h
MD2CARH_CH3_SIZE                         equ 0001h
MD2CARH_CH3_LENGTH                       equ 0001h
MD2CARH_CH3_MASK                         equ 0008h
MD2CARH_CH4_POSN                         equ 0004h
MD2CARH_CH4_POSITION                     equ 0004h
MD2CARH_CH4_SIZE                         equ 0001h
MD2CARH_CH4_LENGTH                       equ 0001h
MD2CARH_CH4_MASK                         equ 0010h
MD2CARH_MD2CH_POSN                       equ 0000h
MD2CARH_MD2CH_POSITION                   equ 0000h
MD2CARH_MD2CH_SIZE                       equ 0005h
MD2CARH_MD2CH_LENGTH                     equ 0005h
MD2CARH_MD2CH_MASK                       equ 001Fh
MD2CARH_MD2CH0_POSN                      equ 0000h
MD2CARH_MD2CH0_POSITION                  equ 0000h
MD2CARH_MD2CH0_SIZE                      equ 0001h
MD2CARH_MD2CH0_LENGTH                    equ 0001h
MD2CARH_MD2CH0_MASK                      equ 0001h
MD2CARH_MD2CH1_POSN                      equ 0001h
MD2CARH_MD2CH1_POSITION                  equ 0001h
MD2CARH_MD2CH1_SIZE                      equ 0001h
MD2CARH_MD2CH1_LENGTH                    equ 0001h
MD2CARH_MD2CH1_MASK                      equ 0002h
MD2CARH_MD2CH2_POSN                      equ 0002h
MD2CARH_MD2CH2_POSITION                  equ 0002h
MD2CARH_MD2CH2_SIZE                      equ 0001h
MD2CARH_MD2CH2_LENGTH                    equ 0001h
MD2CARH_MD2CH2_MASK                      equ 0004h
MD2CARH_MD2CH3_POSN                      equ 0003h
MD2CARH_MD2CH3_POSITION                  equ 0003h
MD2CARH_MD2CH3_SIZE                      equ 0001h
MD2CARH_MD2CH3_LENGTH                    equ 0001h
MD2CARH_MD2CH3_MASK                      equ 0008h
MD2CARH_MD2CH4_POSN                      equ 0004h
MD2CARH_MD2CH4_POSITION                  equ 0004h
MD2CARH_MD2CH4_SIZE                      equ 0001h
MD2CARH_MD2CH4_LENGTH                    equ 0001h
MD2CARH_MD2CH4_MASK                      equ 0010h

