GopalSaraf/Practicals/PSDL/include/proc/pic16lf1776.inc
// Register: COG2PHF
#define COG2PHF COG2PHF
COG2PHF                                  equ 070Eh
// bitfield definitions
COG2PHF_PHF_POSN                         equ 0000h
COG2PHF_PHF_POSITION                     equ 0000h
COG2PHF_PHF_SIZE                         equ 0006h
COG2PHF_PHF_LENGTH                       equ 0006h
COG2PHF_PHF_MASK                         equ 003Fh
COG2PHF_PHF0_POSN                        equ 0000h
COG2PHF_PHF0_POSITION                    equ 0000h
COG2PHF_PHF0_SIZE                        equ 0001h
COG2PHF_PHF0_LENGTH                      equ 0001h
COG2PHF_PHF0_MASK                        equ 0001h
COG2PHF_PHF1_POSN                        equ 0001h
COG2PHF_PHF1_POSITION                    equ 0001h
COG2PHF_PHF1_SIZE                        equ 0001h
COG2PHF_PHF1_LENGTH                      equ 0001h
COG2PHF_PHF1_MASK                        equ 0002h
COG2PHF_PHF2_POSN                        equ 0002h
COG2PHF_PHF2_POSITION                    equ 0002h
COG2PHF_PHF2_SIZE                        equ 0001h
COG2PHF_PHF2_LENGTH                      equ 0001h
COG2PHF_PHF2_MASK                        equ 0004h
COG2PHF_PHF3_POSN                        equ 0003h
COG2PHF_PHF3_POSITION                    equ 0003h
COG2PHF_PHF3_SIZE                        equ 0001h
COG2PHF_PHF3_LENGTH                      equ 0001h
COG2PHF_PHF3_MASK                        equ 0008h
COG2PHF_PHF4_POSN                        equ 0004h
COG2PHF_PHF4_POSITION                    equ 0004h
COG2PHF_PHF4_SIZE                        equ 0001h
COG2PHF_PHF4_LENGTH                      equ 0001h
COG2PHF_PHF4_MASK                        equ 0010h
COG2PHF_PHF5_POSN                        equ 0005h
COG2PHF_PHF5_POSITION                    equ 0005h
COG2PHF_PHF5_SIZE                        equ 0001h
COG2PHF_PHF5_LENGTH                      equ 0001h
COG2PHF_PHF5_MASK                        equ 0020h
COG2PHF_G2PHF0_POSN                      equ 0000h
COG2PHF_G2PHF0_POSITION                  equ 0000h
COG2PHF_G2PHF0_SIZE                      equ 0001h
COG2PHF_G2PHF0_LENGTH                    equ 0001h
COG2PHF_G2PHF0_MASK                      equ 0001h
COG2PHF_G2PHF1_POSN                      equ 0001h
COG2PHF_G2PHF1_POSITION                  equ 0001h
COG2PHF_G2PHF1_SIZE                      equ 0001h
COG2PHF_G2PHF1_LENGTH                    equ 0001h
COG2PHF_G2PHF1_MASK                      equ 0002h
COG2PHF_G2PHF2_POSN                      equ 0002h
COG2PHF_G2PHF2_POSITION                  equ 0002h
COG2PHF_G2PHF2_SIZE                      equ 0001h
COG2PHF_G2PHF2_LENGTH                    equ 0001h
COG2PHF_G2PHF2_MASK                      equ 0004h
COG2PHF_G2PHF3_POSN                      equ 0003h
COG2PHF_G2PHF3_POSITION                  equ 0003h
COG2PHF_G2PHF3_SIZE                      equ 0001h
COG2PHF_G2PHF3_LENGTH                    equ 0001h
COG2PHF_G2PHF3_MASK                      equ 0008h
COG2PHF_G2PHF4_POSN                      equ 0004h
COG2PHF_G2PHF4_POSITION                  equ 0004h
COG2PHF_G2PHF4_SIZE                      equ 0001h
COG2PHF_G2PHF4_LENGTH                    equ 0001h
COG2PHF_G2PHF4_MASK                      equ 0010h
COG2PHF_G2PHF5_POSN                      equ 0005h
COG2PHF_G2PHF5_POSITION                  equ 0005h
COG2PHF_G2PHF5_SIZE                      equ 0001h
COG2PHF_G2PHF5_LENGTH                    equ 0001h
COG2PHF_G2PHF5_MASK                      equ 0020h

// Register: COG2BLKR
#define COG2BLKR COG2BLKR
COG2BLKR                                 equ 070Fh
// bitfield definitions
COG2BLKR_BLKR_POSN                       equ 0000h
COG2BLKR_BLKR_POSITION                   equ 0000h
COG2BLKR_BLKR_SIZE                       equ 0006h
COG2BLKR_BLKR_LENGTH                     equ 0006h
COG2BLKR_BLKR_MASK                       equ 003Fh
COG2BLKR_BLKR0_POSN                      equ 0000h
COG2BLKR_BLKR0_POSITION                  equ 0000h
COG2BLKR_BLKR0_SIZE                      equ 0001h
COG2BLKR_BLKR0_LENGTH                    equ 0001h
COG2BLKR_BLKR0_MASK                      equ 0001h
COG2BLKR_BLKR1_POSN                      equ 0001h
COG2BLKR_BLKR1_POSITION                  equ 0001h
COG2BLKR_BLKR1_SIZE                      equ 0001h
COG2BLKR_BLKR1_LENGTH                    equ 0001h
COG2BLKR_BLKR1_MASK                      equ 0002h
COG2BLKR_BLKR2_POSN                      equ 0002h
COG2BLKR_BLKR2_POSITION                  equ 0002h
COG2BLKR_BLKR2_SIZE                      equ 0001h
COG2BLKR_BLKR2_LENGTH                    equ 0001h
COG2BLKR_BLKR2_MASK                      equ 0004h
COG2BLKR_BLKR3_POSN                      equ 0003h
COG2BLKR_BLKR3_POSITION                  equ 0003h
COG2BLKR_BLKR3_SIZE                      equ 0001h
COG2BLKR_BLKR3_LENGTH                    equ 0001h
COG2BLKR_BLKR3_MASK                      equ 0008h
COG2BLKR_BLKR4_POSN                      equ 0004h
COG2BLKR_BLKR4_POSITION                  equ 0004h
COG2BLKR_BLKR4_SIZE                      equ 0001h
COG2BLKR_BLKR4_LENGTH                    equ 0001h
COG2BLKR_BLKR4_MASK                      equ 0010h
COG2BLKR_BLKR5_POSN                      equ 0005h
COG2BLKR_BLKR5_POSITION                  equ 0005h
COG2BLKR_BLKR5_SIZE                      equ 0001h
COG2BLKR_BLKR5_LENGTH                    equ 0001h
COG2BLKR_BLKR5_MASK                      equ 0020h
COG2BLKR_G2BLKR0_POSN                    equ 0000h
COG2BLKR_G2BLKR0_POSITION                equ 0000h
COG2BLKR_G2BLKR0_SIZE                    equ 0001h
COG2BLKR_G2BLKR0_LENGTH                  equ 0001h
COG2BLKR_G2BLKR0_MASK                    equ 0001h
COG2BLKR_G2BLKR1_POSN                    equ 0001h
COG2BLKR_G2BLKR1_POSITION                equ 0001h
COG2BLKR_G2BLKR1_SIZE                    equ 0001h
COG2BLKR_G2BLKR1_LENGTH                  equ 0001h
COG2BLKR_G2BLKR1_MASK                    equ 0002h
COG2BLKR_G2BLKR2_POSN                    equ 0002h
COG2BLKR_G2BLKR2_POSITION                equ 0002h
COG2BLKR_G2BLKR2_SIZE                    equ 0001h
COG2BLKR_G2BLKR2_LENGTH                  equ 0001h
COG2BLKR_G2BLKR2_MASK                    equ 0004h
COG2BLKR_G2BLKR3_POSN                    equ 0003h
COG2BLKR_G2BLKR3_POSITION                equ 0003h
COG2BLKR_G2BLKR3_SIZE                    equ 0001h
COG2BLKR_G2BLKR3_LENGTH                  equ 0001h
COG2BLKR_G2BLKR3_MASK                    equ 0008h
COG2BLKR_G2BLKR4_POSN                    equ 0004h
COG2BLKR_G2BLKR4_POSITION                equ 0004h
COG2BLKR_G2BLKR4_SIZE                    equ 0001h
COG2BLKR_G2BLKR4_LENGTH                  equ 0001h
COG2BLKR_G2BLKR4_MASK                    equ 0010h
COG2BLKR_G2BLKR5_POSN                    equ 0005h
COG2BLKR_G2BLKR5_POSITION                equ 0005h
COG2BLKR_G2BLKR5_SIZE                    equ 0001h
COG2BLKR_G2BLKR5_LENGTH                  equ 0001h
COG2BLKR_G2BLKR5_MASK                    equ 0020h

// Register: COG2BLKF
#define COG2BLKF COG2BLKF
COG2BLKF                                 equ 0710h
// bitfield definitions
COG2BLKF_BLKF_POSN                       equ 0000h
COG2BLKF_BLKF_POSITION                   equ 0000h
COG2BLKF_BLKF_SIZE                       equ 0006h
COG2BLKF_BLKF_LENGTH                     equ 0006h
COG2BLKF_BLKF_MASK                       equ 003Fh
COG2BLKF_BLKF0_POSN                      equ 0000h
COG2BLKF_BLKF0_POSITION                  equ 0000h
COG2BLKF_BLKF0_SIZE                      equ 0001h
COG2BLKF_BLKF0_LENGTH                    equ 0001h
COG2BLKF_BLKF0_MASK                      equ 0001h
COG2BLKF_BLKF1_POSN                      equ 0001h
COG2BLKF_BLKF1_POSITION                  equ 0001h
COG2BLKF_BLKF1_SIZE                      equ 0001h
COG2BLKF_BLKF1_LENGTH                    equ 0001h
COG2BLKF_BLKF1_MASK                      equ 0002h
COG2BLKF_BLKF2_POSN                      equ 0002h
COG2BLKF_BLKF2_POSITION                  equ 0002h
COG2BLKF_BLKF2_SIZE                      equ 0001h
COG2BLKF_BLKF2_LENGTH                    equ 0001h
COG2BLKF_BLKF2_MASK                      equ 0004h
COG2BLKF_BLKF3_POSN                      equ 0003h
COG2BLKF_BLKF3_POSITION                  equ 0003h
COG2BLKF_BLKF3_SIZE                      equ 0001h
COG2BLKF_BLKF3_LENGTH                    equ 0001h
COG2BLKF_BLKF3_MASK                      equ 0008h
COG2BLKF_BLKF4_POSN                      equ 0004h
COG2BLKF_BLKF4_POSITION                  equ 0004h
COG2BLKF_BLKF4_SIZE                      equ 0001h
COG2BLKF_BLKF4_LENGTH                    equ 0001h
COG2BLKF_BLKF4_MASK                      equ 0010h
COG2BLKF_BLKF5_POSN                      equ 0005h
COG2BLKF_BLKF5_POSITION                  equ 0005h
COG2BLKF_BLKF5_SIZE                      equ 0001h
COG2BLKF_BLKF5_LENGTH                    equ 0001h
COG2BLKF_BLKF5_MASK                      equ 0020h
COG2BLKF_G2BLKF0_POSN                    equ 0000h
COG2BLKF_G2BLKF0_POSITION                equ 0000h
COG2BLKF_G2BLKF0_SIZE                    equ 0001h
COG2BLKF_G2BLKF0_LENGTH                  equ 0001h
COG2BLKF_G2BLKF0_MASK                    equ 0001h
COG2BLKF_G2BLKF1_POSN                    equ 0001h
COG2BLKF_G2BLKF1_POSITION                equ 0001h
COG2BLKF_G2BLKF1_SIZE                    equ 0001h
COG2BLKF_G2BLKF1_LENGTH                  equ 0001h
COG2BLKF_G2BLKF1_MASK                    equ 0002h
COG2BLKF_G2BLKF2_POSN                    equ 0002h
COG2BLKF_G2BLKF2_POSITION                equ 0002h
COG2BLKF_G2BLKF2_SIZE                    equ 0001h
COG2BLKF_G2BLKF2_LENGTH                  equ 0001h
COG2BLKF_G2BLKF2_MASK                    equ 0004h
COG2BLKF_G2BLKF3_POSN                    equ 0003h
COG2BLKF_G2BLKF3_POSITION                equ 0003h
COG2BLKF_G2BLKF3_SIZE                    equ 0001h
COG2BLKF_G2BLKF3_LENGTH                  equ 0001h
COG2BLKF_G2BLKF3_MASK                    equ 0008h
COG2BLKF_G2BLKF4_POSN                    equ 0004h
COG2BLKF_G2BLKF4_POSITION                equ 0004h
COG2BLKF_G2BLKF4_SIZE                    equ 0001h
COG2BLKF_G2BLKF4_LENGTH                  equ 0001h
COG2BLKF_G2BLKF4_MASK                    equ 0010h
COG2BLKF_G2BLKF5_POSN                    equ 0005h
COG2BLKF_G2BLKF5_POSITION                equ 0005h
COG2BLKF_G2BLKF5_SIZE                    equ 0001h
COG2BLKF_G2BLKF5_LENGTH                  equ 0001h
COG2BLKF_G2BLKF5_MASK                    equ 0020h

// Register: COG2DBR
#define COG2DBR COG2DBR
COG2DBR                                  equ 0711h
// bitfield definitions
COG2DBR_DBR_POSN                         equ 0000h
COG2DBR_DBR_POSITION                     equ 0000h
COG2DBR_DBR_SIZE                         equ 0006h
COG2DBR_DBR_LENGTH                       equ 0006h
COG2DBR_DBR_MASK                         equ 003Fh
COG2DBR_DBR0_POSN                        equ 0000h
COG2DBR_DBR0_POSITION                    equ 0000h
COG2DBR_DBR0_SIZE                        equ 0001h
COG2DBR_DBR0_LENGTH                      equ 0001h
COG2DBR_DBR0_MASK                        equ 0001h
COG2DBR_DBR1_POSN                        equ 0001h
COG2DBR_DBR1_POSITION                    equ 0001h
COG2DBR_DBR1_SIZE                        equ 0001h
COG2DBR_DBR1_LENGTH                      equ 0001h
COG2DBR_DBR1_MASK                        equ 0002h
COG2DBR_DBR2_POSN                        equ 0002h
COG2DBR_DBR2_POSITION                    equ 0002h
COG2DBR_DBR2_SIZE                        equ 0001h
COG2DBR_DBR2_LENGTH                      equ 0001h
COG2DBR_DBR2_MASK                        equ 0004h
COG2DBR_DBR3_POSN                        equ 0003h
COG2DBR_DBR3_POSITION                    equ 0003h
COG2DBR_DBR3_SIZE                        equ 0001h
COG2DBR_DBR3_LENGTH                      equ 0001h
COG2DBR_DBR3_MASK                        equ 0008h
COG2DBR_DBR4_POSN                        equ 0004h
COG2DBR_DBR4_POSITION                    equ 0004h
COG2DBR_DBR4_SIZE                        equ 0001h
COG2DBR_DBR4_LENGTH                      equ 0001h
COG2DBR_DBR4_MASK                        equ 0010h
COG2DBR_DBR5_POSN                        equ 0005h
COG2DBR_DBR5_POSITION                    equ 0005h
COG2DBR_DBR5_SIZE                        equ 0001h
COG2DBR_DBR5_LENGTH                      equ 0001h
COG2DBR_DBR5_MASK                        equ 0020h
COG2DBR_G2DBR0_POSN                      equ 0000h
COG2DBR_G2DBR0_POSITION                  equ 0000h
COG2DBR_G2DBR0_SIZE                      equ 0001h
COG2DBR_G2DBR0_LENGTH                    equ 0001h
COG2DBR_G2DBR0_MASK                      equ 0001h
COG2DBR_G2DBR1_POSN                      equ 0001h
COG2DBR_G2DBR1_POSITION                  equ 0001h
COG2DBR_G2DBR1_SIZE                      equ 0001h
COG2DBR_G2DBR1_LENGTH                    equ 0001h
COG2DBR_G2DBR1_MASK                      equ 0002h
COG2DBR_G2DBR2_POSN                      equ 0002h
COG2DBR_G2DBR2_POSITION                  equ 0002h
COG2DBR_G2DBR2_SIZE                      equ 0001h
COG2DBR_G2DBR2_LENGTH                    equ 0001h
COG2DBR_G2DBR2_MASK                      equ 0004h
COG2DBR_G2DBR3_POSN                      equ 0003h
COG2DBR_G2DBR3_POSITION                  equ 0003h
COG2DBR_G2DBR3_SIZE                      equ 0001h
COG2DBR_G2DBR3_LENGTH                    equ 0001h
COG2DBR_G2DBR3_MASK                      equ 0008h
COG2DBR_G2DBR4_POSN                      equ 0004h
COG2DBR_G2DBR4_POSITION                  equ 0004h
COG2DBR_G2DBR4_SIZE                      equ 0001h
COG2DBR_G2DBR4_LENGTH                    equ 0001h
COG2DBR_G2DBR4_MASK                      equ 0010h
COG2DBR_G2DBR5_POSN                      equ 0005h
COG2DBR_G2DBR5_POSITION                  equ 0005h
COG2DBR_G2DBR5_SIZE                      equ 0001h
COG2DBR_G2DBR5_LENGTH                    equ 0001h
COG2DBR_G2DBR5_MASK                      equ 0020h

// Register: COG2DBF
#define COG2DBF COG2DBF
COG2DBF                                  equ 0712h
// bitfield definitions
COG2DBF_DBF0_POSN                        equ 0000h
COG2DBF_DBF0_POSITION                    equ 0000h
COG2DBF_DBF0_SIZE                        equ 0001h
COG2DBF_DBF0_LENGTH                      equ 0001h
COG2DBF_DBF0_MASK                        equ 0001h
COG2DBF_DBF1_POSN                        equ 0001h
COG2DBF_DBF1_POSITION                    equ 0001h
COG2DBF_DBF1_SIZE                        equ 0001h
COG2DBF_DBF1_LENGTH                      equ 0001h
COG2DBF_DBF1_MASK                        equ 0002h
COG2DBF_DBF2_POSN                        equ 0002h
COG2DBF_DBF2_POSITION                    equ 0002h
COG2DBF_DBF2_SIZE                        equ 0001h
COG2DBF_DBF2_LENGTH                      equ 0001h
COG2DBF_DBF2_MASK                        equ 0004h
COG2DBF_DBF3_POSN                        equ 0003h
COG2DBF_DBF3_POSITION                    equ 0003h
COG2DBF_DBF3_SIZE                        equ 0001h
COG2DBF_DBF3_LENGTH                      equ 0001h
COG2DBF_DBF3_MASK                        equ 0008h
COG2DBF_DBF4_POSN                        equ 0004h
COG2DBF_DBF4_POSITION                    equ 0004h
COG2DBF_DBF4_SIZE                        equ 0001h
COG2DBF_DBF4_LENGTH                      equ 0001h
COG2DBF_DBF4_MASK                        equ 0010h
COG2DBF_DBF5_POSN                        equ 0005h
COG2DBF_DBF5_POSITION                    equ 0005h
COG2DBF_DBF5_SIZE                        equ 0001h
COG2DBF_DBF5_LENGTH                      equ 0001h
COG2DBF_DBF5_MASK                        equ 0020h
COG2DBF_G2DBF0_POSN                      equ 0000h
COG2DBF_G2DBF0_POSITION                  equ 0000h
COG2DBF_G2DBF0_SIZE                      equ 0001h
COG2DBF_G2DBF0_LENGTH                    equ 0001h
COG2DBF_G2DBF0_MASK                      equ 0001h
COG2DBF_G2DBF1_POSN                      equ 0001h
COG2DBF_G2DBF1_POSITION                  equ 0001h
COG2DBF_G2DBF1_SIZE                      equ 0001h
COG2DBF_G2DBF1_LENGTH                    equ 0001h
COG2DBF_G2DBF1_MASK                      equ 0002h
COG2DBF_G2DBF2_POSN                      equ 0002h
COG2DBF_G2DBF2_POSITION                  equ 0002h
COG2DBF_G2DBF2_SIZE                      equ 0001h
COG2DBF_G2DBF2_LENGTH                    equ 0001h
COG2DBF_G2DBF2_MASK                      equ 0004h
COG2DBF_G2DBF3_POSN                      equ 0003h
COG2DBF_G2DBF3_POSITION                  equ 0003h
COG2DBF_G2DBF3_SIZE                      equ 0001h
COG2DBF_G2DBF3_LENGTH                    equ 0001h
COG2DBF_G2DBF3_MASK                      equ 0008h
COG2DBF_G2DBF4_POSN                      equ 0004h
COG2DBF_G2DBF4_POSITION                  equ 0004h
COG2DBF_G2DBF4_SIZE                      equ 0001h
COG2DBF_G2DBF4_LENGTH                    equ 0001h
COG2DBF_G2DBF4_MASK                      equ 0010h
COG2DBF_G2DBF5_POSN                      equ 0005h
COG2DBF_G2DBF5_POSITION                  equ 0005h
COG2DBF_G2DBF5_SIZE                      equ 0001h
COG2DBF_G2DBF5_LENGTH                    equ 0001h
COG2DBF_G2DBF5_MASK                      equ 0020h
COG2DBF_G2DBF_POSN                       equ 0000h
COG2DBF_G2DBF_POSITION                   equ 0000h
COG2DBF_G2DBF_SIZE                       equ 0006h
COG2DBF_G2DBF_LENGTH                     equ 0006h
COG2DBF_G2DBF_MASK                       equ 003Fh

// Register: COG2CON0
#define COG2CON0 COG2CON0
COG2CON0                                 equ 0713h
// bitfield definitions
COG2CON0_MD_POSN                         equ 0000h
COG2CON0_MD_POSITION                     equ 0000h
COG2CON0_MD_SIZE                         equ 0003h
COG2CON0_MD_LENGTH                       equ 0003h
COG2CON0_MD_MASK                         equ 0007h
COG2CON0_CS_POSN                         equ 0003h
COG2CON0_CS_POSITION                     equ 0003h
COG2CON0_CS_SIZE                         equ 0002h
COG2CON0_CS_LENGTH                       equ 0002h
COG2CON0_CS_MASK                         equ 0018h
COG2CON0_LD_POSN                         equ 0006h
COG2CON0_LD_POSITION                     equ 0006h
COG2CON0_LD_SIZE                         equ 0001h
COG2CON0_LD_LENGTH                       equ 0001h
COG2CON0_LD_MASK                         equ 0040h
COG2CON0_EN_POSN                         equ 0007h
COG2CON0_EN_POSITION                     equ 0007h
COG2CON0_EN_SIZE                         equ 0001h
COG2CON0_EN_LENGTH                       equ 0001h
COG2CON0_EN_MASK                         equ 0080h
COG2CON0_MD0_POSN                        equ 0000h
COG2CON0_MD0_POSITION                    equ 0000h
COG2CON0_MD0_SIZE                        equ 0001h
COG2CON0_MD0_LENGTH                      equ 0001h
COG2CON0_MD0_MASK                        equ 0001h
COG2CON0_MD1_POSN                        equ 0001h
COG2CON0_MD1_POSITION                    equ 0001h
COG2CON0_MD1_SIZE                        equ 0001h
COG2CON0_MD1_LENGTH                      equ 0001h
COG2CON0_MD1_MASK                        equ 0002h
COG2CON0_MD2_POSN                        equ 0002h
COG2CON0_MD2_POSITION                    equ 0002h
COG2CON0_MD2_SIZE                        equ 0001h
COG2CON0_MD2_LENGTH                      equ 0001h
COG2CON0_MD2_MASK                        equ 0004h
COG2CON0_CS0_POSN                        equ 0003h
COG2CON0_CS0_POSITION                    equ 0003h
COG2CON0_CS0_SIZE                        equ 0001h
COG2CON0_CS0_LENGTH                      equ 0001h
COG2CON0_CS0_MASK                        equ 0008h
COG2CON0_CS1_POSN                        equ 0004h
COG2CON0_CS1_POSITION                    equ 0004h
COG2CON0_CS1_SIZE                        equ 0001h
COG2CON0_CS1_LENGTH                      equ 0001h
COG2CON0_CS1_MASK                        equ 0010h
COG2CON0_G2MD_POSN                       equ 0000h
COG2CON0_G2MD_POSITION                   equ 0000h
COG2CON0_G2MD_SIZE                       equ 0003h
COG2CON0_G2MD_LENGTH                     equ 0003h
COG2CON0_G2MD_MASK                       equ 0007h
COG2CON0_G2CS_POSN                       equ 0003h
COG2CON0_G2CS_POSITION                   equ 0003h
COG2CON0_G2CS_SIZE                       equ 0002h
COG2CON0_G2CS_LENGTH                     equ 0002h
COG2CON0_G2CS_MASK                       equ 0018h
COG2CON0_G2LD_POSN                       equ 0006h
COG2CON0_G2LD_POSITION                   equ 0006h
COG2CON0_G2LD_SIZE                       equ 0001h
COG2CON0_G2LD_LENGTH                     equ 0001h
COG2CON0_G2LD_MASK                       equ 0040h
COG2CON0_G2EN_POSN                       equ 0007h
COG2CON0_G2EN_POSITION                   equ 0007h
COG2CON0_G2EN_SIZE                       equ 0001h
COG2CON0_G2EN_LENGTH                     equ 0001h
COG2CON0_G2EN_MASK                       equ 0080h
COG2CON0_G2MD0_POSN                      equ 0000h
COG2CON0_G2MD0_POSITION                  equ 0000h
COG2CON0_G2MD0_SIZE                      equ 0001h
COG2CON0_G2MD0_LENGTH                    equ 0001h
COG2CON0_G2MD0_MASK                      equ 0001h
COG2CON0_G2MD1_POSN                      equ 0001h
COG2CON0_G2MD1_POSITION                  equ 0001h
COG2CON0_G2MD1_SIZE                      equ 0001h
COG2CON0_G2MD1_LENGTH                    equ 0001h
COG2CON0_G2MD1_MASK                      equ 0002h
COG2CON0_G2MD2_POSN                      equ 0002h
COG2CON0_G2MD2_POSITION                  equ 0002h
COG2CON0_G2MD2_SIZE                      equ 0001h
COG2CON0_G2MD2_LENGTH                    equ 0001h
COG2CON0_G2MD2_MASK                      equ 0004h
COG2CON0_G2CS0_POSN                      equ 0003h
COG2CON0_G2CS0_POSITION                  equ 0003h
COG2CON0_G2CS0_SIZE                      equ 0001h
COG2CON0_G2CS0_LENGTH                    equ 0001h
COG2CON0_G2CS0_MASK                      equ 0008h
COG2CON0_G2CS1_POSN                      equ 0004h
COG2CON0_G2CS1_POSITION                  equ 0004h
COG2CON0_G2CS1_SIZE                      equ 0001h
COG2CON0_G2CS1_LENGTH                    equ 0001h
COG2CON0_G2CS1_MASK                      equ 0010h

