GopalSaraf/Practicals/PSDL/include/proc/pic16lf1776.inc
// Register: PWM5OFL
#define PWM5OFL PWM5OFL
PWM5OFL                                  equ 0D97h
// bitfield definitions
PWM5OFL_OF_POSN                          equ 0000h
PWM5OFL_OF_POSITION                      equ 0000h
PWM5OFL_OF_SIZE                          equ 0008h
PWM5OFL_OF_LENGTH                        equ 0008h
PWM5OFL_OF_MASK                          equ 00FFh
PWM5OFL_PWM5OFL0_POSN                    equ 0000h
PWM5OFL_PWM5OFL0_POSITION                equ 0000h
PWM5OFL_PWM5OFL0_SIZE                    equ 0001h
PWM5OFL_PWM5OFL0_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL0_MASK                    equ 0001h
PWM5OFL_PWM5OFL1_POSN                    equ 0001h
PWM5OFL_PWM5OFL1_POSITION                equ 0001h
PWM5OFL_PWM5OFL1_SIZE                    equ 0001h
PWM5OFL_PWM5OFL1_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL1_MASK                    equ 0002h
PWM5OFL_PWM5OFL2_POSN                    equ 0002h
PWM5OFL_PWM5OFL2_POSITION                equ 0002h
PWM5OFL_PWM5OFL2_SIZE                    equ 0001h
PWM5OFL_PWM5OFL2_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL2_MASK                    equ 0004h
PWM5OFL_PWM5OFL3_POSN                    equ 0003h
PWM5OFL_PWM5OFL3_POSITION                equ 0003h
PWM5OFL_PWM5OFL3_SIZE                    equ 0001h
PWM5OFL_PWM5OFL3_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL3_MASK                    equ 0008h
PWM5OFL_PWM5OFL4_POSN                    equ 0004h
PWM5OFL_PWM5OFL4_POSITION                equ 0004h
PWM5OFL_PWM5OFL4_SIZE                    equ 0001h
PWM5OFL_PWM5OFL4_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL4_MASK                    equ 0010h
PWM5OFL_PWM5OFL5_POSN                    equ 0005h
PWM5OFL_PWM5OFL5_POSITION                equ 0005h
PWM5OFL_PWM5OFL5_SIZE                    equ 0001h
PWM5OFL_PWM5OFL5_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL5_MASK                    equ 0020h
PWM5OFL_PWM5OFL6_POSN                    equ 0006h
PWM5OFL_PWM5OFL6_POSITION                equ 0006h
PWM5OFL_PWM5OFL6_SIZE                    equ 0001h
PWM5OFL_PWM5OFL6_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL6_MASK                    equ 0040h
PWM5OFL_PWM5OFL7_POSN                    equ 0007h
PWM5OFL_PWM5OFL7_POSITION                equ 0007h
PWM5OFL_PWM5OFL7_SIZE                    equ 0001h
PWM5OFL_PWM5OFL7_LENGTH                  equ 0001h
PWM5OFL_PWM5OFL7_MASK                    equ 0080h
PWM5OFL_PWM5OFL_POSN                     equ 0000h
PWM5OFL_PWM5OFL_POSITION                 equ 0000h
PWM5OFL_PWM5OFL_SIZE                     equ 0008h
PWM5OFL_PWM5OFL_LENGTH                   equ 0008h
PWM5OFL_PWM5OFL_MASK                     equ 00FFh

// Register: PWM5OFH
#define PWM5OFH PWM5OFH
PWM5OFH                                  equ 0D98h
// bitfield definitions
PWM5OFH_OF_POSN                          equ 0000h
PWM5OFH_OF_POSITION                      equ 0000h
PWM5OFH_OF_SIZE                          equ 0008h
PWM5OFH_OF_LENGTH                        equ 0008h
PWM5OFH_OF_MASK                          equ 00FFh
PWM5OFH_PWM5OFH0_POSN                    equ 0000h
PWM5OFH_PWM5OFH0_POSITION                equ 0000h
PWM5OFH_PWM5OFH0_SIZE                    equ 0001h
PWM5OFH_PWM5OFH0_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH0_MASK                    equ 0001h
PWM5OFH_PWM5OFH1_POSN                    equ 0001h
PWM5OFH_PWM5OFH1_POSITION                equ 0001h
PWM5OFH_PWM5OFH1_SIZE                    equ 0001h
PWM5OFH_PWM5OFH1_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH1_MASK                    equ 0002h
PWM5OFH_PWM5OFH2_POSN                    equ 0002h
PWM5OFH_PWM5OFH2_POSITION                equ 0002h
PWM5OFH_PWM5OFH2_SIZE                    equ 0001h
PWM5OFH_PWM5OFH2_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH2_MASK                    equ 0004h
PWM5OFH_PWM5OFH3_POSN                    equ 0003h
PWM5OFH_PWM5OFH3_POSITION                equ 0003h
PWM5OFH_PWM5OFH3_SIZE                    equ 0001h
PWM5OFH_PWM5OFH3_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH3_MASK                    equ 0008h
PWM5OFH_PWM5OFH4_POSN                    equ 0004h
PWM5OFH_PWM5OFH4_POSITION                equ 0004h
PWM5OFH_PWM5OFH4_SIZE                    equ 0001h
PWM5OFH_PWM5OFH4_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH4_MASK                    equ 0010h
PWM5OFH_PWM5OFH5_POSN                    equ 0005h
PWM5OFH_PWM5OFH5_POSITION                equ 0005h
PWM5OFH_PWM5OFH5_SIZE                    equ 0001h
PWM5OFH_PWM5OFH5_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH5_MASK                    equ 0020h
PWM5OFH_PWM5OFH6_POSN                    equ 0006h
PWM5OFH_PWM5OFH6_POSITION                equ 0006h
PWM5OFH_PWM5OFH6_SIZE                    equ 0001h
PWM5OFH_PWM5OFH6_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH6_MASK                    equ 0040h
PWM5OFH_PWM5OFH7_POSN                    equ 0007h
PWM5OFH_PWM5OFH7_POSITION                equ 0007h
PWM5OFH_PWM5OFH7_SIZE                    equ 0001h
PWM5OFH_PWM5OFH7_LENGTH                  equ 0001h
PWM5OFH_PWM5OFH7_MASK                    equ 0080h
PWM5OFH_PWM5OFH_POSN                     equ 0000h
PWM5OFH_PWM5OFH_POSITION                 equ 0000h
PWM5OFH_PWM5OFH_SIZE                     equ 0008h
PWM5OFH_PWM5OFH_LENGTH                   equ 0008h
PWM5OFH_PWM5OFH_MASK                     equ 00FFh

// Register: PWM5TMRL
#define PWM5TMRL PWM5TMRL
PWM5TMRL                                 equ 0D99h
// bitfield definitions
PWM5TMRL_TMR_POSN                        equ 0000h
PWM5TMRL_TMR_POSITION                    equ 0000h
PWM5TMRL_TMR_SIZE                        equ 0008h
PWM5TMRL_TMR_LENGTH                      equ 0008h
PWM5TMRL_TMR_MASK                        equ 00FFh
PWM5TMRL_PWM5TMRL0_POSN                  equ 0000h
PWM5TMRL_PWM5TMRL0_POSITION              equ 0000h
PWM5TMRL_PWM5TMRL0_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL0_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL0_MASK                  equ 0001h
PWM5TMRL_PWM5TMRL1_POSN                  equ 0001h
PWM5TMRL_PWM5TMRL1_POSITION              equ 0001h
PWM5TMRL_PWM5TMRL1_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL1_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL1_MASK                  equ 0002h
PWM5TMRL_PWM5TMRL2_POSN                  equ 0002h
PWM5TMRL_PWM5TMRL2_POSITION              equ 0002h
PWM5TMRL_PWM5TMRL2_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL2_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL2_MASK                  equ 0004h
PWM5TMRL_PWM5TMRL3_POSN                  equ 0003h
PWM5TMRL_PWM5TMRL3_POSITION              equ 0003h
PWM5TMRL_PWM5TMRL3_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL3_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL3_MASK                  equ 0008h
PWM5TMRL_PWM5TMRL4_POSN                  equ 0004h
PWM5TMRL_PWM5TMRL4_POSITION              equ 0004h
PWM5TMRL_PWM5TMRL4_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL4_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL4_MASK                  equ 0010h
PWM5TMRL_PWM5TMRL5_POSN                  equ 0005h
PWM5TMRL_PWM5TMRL5_POSITION              equ 0005h
PWM5TMRL_PWM5TMRL5_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL5_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL5_MASK                  equ 0020h
PWM5TMRL_PWM5TMRL6_POSN                  equ 0006h
PWM5TMRL_PWM5TMRL6_POSITION              equ 0006h
PWM5TMRL_PWM5TMRL6_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL6_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL6_MASK                  equ 0040h
PWM5TMRL_PWM5TMRL7_POSN                  equ 0007h
PWM5TMRL_PWM5TMRL7_POSITION              equ 0007h
PWM5TMRL_PWM5TMRL7_SIZE                  equ 0001h
PWM5TMRL_PWM5TMRL7_LENGTH                equ 0001h
PWM5TMRL_PWM5TMRL7_MASK                  equ 0080h
PWM5TMRL_PWM5TMRL_POSN                   equ 0000h
PWM5TMRL_PWM5TMRL_POSITION               equ 0000h
PWM5TMRL_PWM5TMRL_SIZE                   equ 0008h
PWM5TMRL_PWM5TMRL_LENGTH                 equ 0008h
PWM5TMRL_PWM5TMRL_MASK                   equ 00FFh

// Register: PWM5TMRH
#define PWM5TMRH PWM5TMRH
PWM5TMRH                                 equ 0D9Ah
// bitfield definitions
PWM5TMRH_TMR_POSN                        equ 0000h
PWM5TMRH_TMR_POSITION                    equ 0000h
PWM5TMRH_TMR_SIZE                        equ 0008h
PWM5TMRH_TMR_LENGTH                      equ 0008h
PWM5TMRH_TMR_MASK                        equ 00FFh
PWM5TMRH_PWM5TMRH0_POSN                  equ 0000h
PWM5TMRH_PWM5TMRH0_POSITION              equ 0000h
PWM5TMRH_PWM5TMRH0_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH0_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH0_MASK                  equ 0001h
PWM5TMRH_PWM5TMRH1_POSN                  equ 0001h
PWM5TMRH_PWM5TMRH1_POSITION              equ 0001h
PWM5TMRH_PWM5TMRH1_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH1_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH1_MASK                  equ 0002h
PWM5TMRH_PWM5TMRH2_POSN                  equ 0002h
PWM5TMRH_PWM5TMRH2_POSITION              equ 0002h
PWM5TMRH_PWM5TMRH2_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH2_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH2_MASK                  equ 0004h
PWM5TMRH_PWM5TMRH3_POSN                  equ 0003h
PWM5TMRH_PWM5TMRH3_POSITION              equ 0003h
PWM5TMRH_PWM5TMRH3_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH3_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH3_MASK                  equ 0008h
PWM5TMRH_PWM5TMRH4_POSN                  equ 0004h
PWM5TMRH_PWM5TMRH4_POSITION              equ 0004h
PWM5TMRH_PWM5TMRH4_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH4_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH4_MASK                  equ 0010h
PWM5TMRH_PWM5TMRH5_POSN                  equ 0005h
PWM5TMRH_PWM5TMRH5_POSITION              equ 0005h
PWM5TMRH_PWM5TMRH5_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH5_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH5_MASK                  equ 0020h
PWM5TMRH_PWM5TMRH6_POSN                  equ 0006h
PWM5TMRH_PWM5TMRH6_POSITION              equ 0006h
PWM5TMRH_PWM5TMRH6_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH6_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH6_MASK                  equ 0040h
PWM5TMRH_PWM5TMRH7_POSN                  equ 0007h
PWM5TMRH_PWM5TMRH7_POSITION              equ 0007h
PWM5TMRH_PWM5TMRH7_SIZE                  equ 0001h
PWM5TMRH_PWM5TMRH7_LENGTH                equ 0001h
PWM5TMRH_PWM5TMRH7_MASK                  equ 0080h
PWM5TMRH_PWM5TMRH_POSN                   equ 0000h
PWM5TMRH_PWM5TMRH_POSITION               equ 0000h
PWM5TMRH_PWM5TMRH_SIZE                   equ 0008h
PWM5TMRH_PWM5TMRH_LENGTH                 equ 0008h
PWM5TMRH_PWM5TMRH_MASK                   equ 00FFh

// Register: PWM5CON
#define PWM5CON PWM5CON
PWM5CON                                  equ 0D9Bh
// bitfield definitions
PWM5CON_MODE_POSN                        equ 0002h
PWM5CON_MODE_POSITION                    equ 0002h
PWM5CON_MODE_SIZE                        equ 0002h
PWM5CON_MODE_LENGTH                      equ 0002h
PWM5CON_MODE_MASK                        equ 000Ch
PWM5CON_POL_POSN                         equ 0004h
PWM5CON_POL_POSITION                     equ 0004h
PWM5CON_POL_SIZE                         equ 0001h
PWM5CON_POL_LENGTH                       equ 0001h
PWM5CON_POL_MASK                         equ 0010h
PWM5CON_OUT_POSN                         equ 0005h
PWM5CON_OUT_POSITION                     equ 0005h
PWM5CON_OUT_SIZE                         equ 0001h
PWM5CON_OUT_LENGTH                       equ 0001h
PWM5CON_OUT_MASK                         equ 0020h
PWM5CON_EN_POSN                          equ 0007h
PWM5CON_EN_POSITION                      equ 0007h
PWM5CON_EN_SIZE                          equ 0001h
PWM5CON_EN_LENGTH                        equ 0001h
PWM5CON_EN_MASK                          equ 0080h
PWM5CON_PWM5MODE0_POSN                   equ 0002h
PWM5CON_PWM5MODE0_POSITION               equ 0002h
PWM5CON_PWM5MODE0_SIZE                   equ 0001h
PWM5CON_PWM5MODE0_LENGTH                 equ 0001h
PWM5CON_PWM5MODE0_MASK                   equ 0004h
PWM5CON_PWM5MODE1_POSN                   equ 0003h
PWM5CON_PWM5MODE1_POSITION               equ 0003h
PWM5CON_PWM5MODE1_SIZE                   equ 0001h
PWM5CON_PWM5MODE1_LENGTH                 equ 0001h
PWM5CON_PWM5MODE1_MASK                   equ 0008h
PWM5CON_PWM5MODE_POSN                    equ 0002h
PWM5CON_PWM5MODE_POSITION                equ 0002h
PWM5CON_PWM5MODE_SIZE                    equ 0002h
PWM5CON_PWM5MODE_LENGTH                  equ 0002h
PWM5CON_PWM5MODE_MASK                    equ 000Ch
PWM5CON_PWM5POL_POSN                     equ 0004h
PWM5CON_PWM5POL_POSITION                 equ 0004h
PWM5CON_PWM5POL_SIZE                     equ 0001h
PWM5CON_PWM5POL_LENGTH                   equ 0001h
PWM5CON_PWM5POL_MASK                     equ 0010h
PWM5CON_PWM5OUT_POSN                     equ 0005h
PWM5CON_PWM5OUT_POSITION                 equ 0005h
PWM5CON_PWM5OUT_SIZE                     equ 0001h
PWM5CON_PWM5OUT_LENGTH                   equ 0001h
PWM5CON_PWM5OUT_MASK                     equ 0020h
PWM5CON_PWM5EN_POSN                      equ 0007h
PWM5CON_PWM5EN_POSITION                  equ 0007h
PWM5CON_PWM5EN_SIZE                      equ 0001h
PWM5CON_PWM5EN_LENGTH                    equ 0001h
PWM5CON_PWM5EN_MASK                      equ 0080h
PWM5CON_MODE0_POSN                       equ 0002h
PWM5CON_MODE0_POSITION                   equ 0002h
PWM5CON_MODE0_SIZE                       equ 0001h
PWM5CON_MODE0_LENGTH                     equ 0001h
PWM5CON_MODE0_MASK                       equ 0004h
PWM5CON_MODE1_POSN                       equ 0003h
PWM5CON_MODE1_POSITION                   equ 0003h
PWM5CON_MODE1_SIZE                       equ 0001h
PWM5CON_MODE1_LENGTH                     equ 0001h
PWM5CON_MODE1_MASK                       equ 0008h

// Register: PWM5INTE
#define PWM5INTE PWM5INTE
PWM5INTE                                 equ 0D9Ch
// bitfield definitions
PWM5INTE_PRIE_POSN                       equ 0000h
PWM5INTE_PRIE_POSITION                   equ 0000h
PWM5INTE_PRIE_SIZE                       equ 0001h
PWM5INTE_PRIE_LENGTH                     equ 0001h
PWM5INTE_PRIE_MASK                       equ 0001h
PWM5INTE_DCIE_POSN                       equ 0001h
PWM5INTE_DCIE_POSITION                   equ 0001h
PWM5INTE_DCIE_SIZE                       equ 0001h
PWM5INTE_DCIE_LENGTH                     equ 0001h
PWM5INTE_DCIE_MASK                       equ 0002h
PWM5INTE_PHIE_POSN                       equ 0002h
PWM5INTE_PHIE_POSITION                   equ 0002h
PWM5INTE_PHIE_SIZE                       equ 0001h
PWM5INTE_PHIE_LENGTH                     equ 0001h
PWM5INTE_PHIE_MASK                       equ 0004h
PWM5INTE_OFIE_POSN                       equ 0003h
PWM5INTE_OFIE_POSITION                   equ 0003h
PWM5INTE_OFIE_SIZE                       equ 0001h
PWM5INTE_OFIE_LENGTH                     equ 0001h
PWM5INTE_OFIE_MASK                       equ 0008h
PWM5INTE_PWM5PRIE_POSN                   equ 0000h
PWM5INTE_PWM5PRIE_POSITION               equ 0000h
PWM5INTE_PWM5PRIE_SIZE                   equ 0001h
PWM5INTE_PWM5PRIE_LENGTH                 equ 0001h
PWM5INTE_PWM5PRIE_MASK                   equ 0001h
PWM5INTE_PWM5DCIE_POSN                   equ 0001h
PWM5INTE_PWM5DCIE_POSITION               equ 0001h
PWM5INTE_PWM5DCIE_SIZE                   equ 0001h
PWM5INTE_PWM5DCIE_LENGTH                 equ 0001h
PWM5INTE_PWM5DCIE_MASK                   equ 0002h
PWM5INTE_PWM5PHIE_POSN                   equ 0002h
PWM5INTE_PWM5PHIE_POSITION               equ 0002h
PWM5INTE_PWM5PHIE_SIZE                   equ 0001h
PWM5INTE_PWM5PHIE_LENGTH                 equ 0001h
PWM5INTE_PWM5PHIE_MASK                   equ 0004h
PWM5INTE_PWM5OFIE_POSN                   equ 0003h
PWM5INTE_PWM5OFIE_POSITION               equ 0003h
PWM5INTE_PWM5OFIE_SIZE                   equ 0001h
PWM5INTE_PWM5OFIE_LENGTH                 equ 0001h
PWM5INTE_PWM5OFIE_MASK                   equ 0008h

// Register: PWM5INTF
#define PWM5INTF PWM5INTF
PWM5INTF                                 equ 0D9Dh
// bitfield definitions
PWM5INTF_PRIF_POSN                       equ 0000h
PWM5INTF_PRIF_POSITION                   equ 0000h
PWM5INTF_PRIF_SIZE                       equ 0001h
PWM5INTF_PRIF_LENGTH                     equ 0001h
PWM5INTF_PRIF_MASK                       equ 0001h
PWM5INTF_DCIF_POSN                       equ 0001h
PWM5INTF_DCIF_POSITION                   equ 0001h
PWM5INTF_DCIF_SIZE                       equ 0001h
PWM5INTF_DCIF_LENGTH                     equ 0001h
PWM5INTF_DCIF_MASK                       equ 0002h
PWM5INTF_PHIF_POSN                       equ 0002h
PWM5INTF_PHIF_POSITION                   equ 0002h
PWM5INTF_PHIF_SIZE                       equ 0001h
PWM5INTF_PHIF_LENGTH                     equ 0001h
PWM5INTF_PHIF_MASK                       equ 0004h
PWM5INTF_OFIF_POSN                       equ 0003h
PWM5INTF_OFIF_POSITION                   equ 0003h
PWM5INTF_OFIF_SIZE                       equ 0001h
PWM5INTF_OFIF_LENGTH                     equ 0001h
PWM5INTF_OFIF_MASK                       equ 0008h
PWM5INTF_PWM5PRIF_POSN                   equ 0000h
PWM5INTF_PWM5PRIF_POSITION               equ 0000h
PWM5INTF_PWM5PRIF_SIZE                   equ 0001h
PWM5INTF_PWM5PRIF_LENGTH                 equ 0001h
PWM5INTF_PWM5PRIF_MASK                   equ 0001h
PWM5INTF_PWM5DCIF_POSN                   equ 0001h
PWM5INTF_PWM5DCIF_POSITION               equ 0001h
PWM5INTF_PWM5DCIF_SIZE                   equ 0001h
PWM5INTF_PWM5DCIF_LENGTH                 equ 0001h
PWM5INTF_PWM5DCIF_MASK                   equ 0002h
PWM5INTF_PWM5PHIF_POSN                   equ 0002h
PWM5INTF_PWM5PHIF_POSITION               equ 0002h
PWM5INTF_PWM5PHIF_SIZE                   equ 0001h
PWM5INTF_PWM5PHIF_LENGTH                 equ 0001h
PWM5INTF_PWM5PHIF_MASK                   equ 0004h
PWM5INTF_PWM5OFIF_POSN                   equ 0003h
PWM5INTF_PWM5OFIF_POSITION               equ 0003h
PWM5INTF_PWM5OFIF_SIZE                   equ 0001h
PWM5INTF_PWM5OFIF_LENGTH                 equ 0001h
PWM5INTF_PWM5OFIF_MASK                   equ 0008h

