GopalSaraf/Practicals/PSDL/include/proc/pic16lf1776.inc
#define DAC5R14                          BANKMASK(DAC5REFH), 6
#define DAC5R15                          BANKMASK(DAC5REFH), 7
#define DAC5R2                           BANKMASK(DAC5REFL), 2
#define DAC5R3                           BANKMASK(DAC5REFL), 3
#define DAC5R4                           BANKMASK(DAC5REFL), 4
#define DAC5R5                           BANKMASK(DAC5REFL), 5
#define DAC5R6                           BANKMASK(DAC5REFL), 6
#define DAC5R7                           BANKMASK(DAC5REFL), 7
#define DAC5R8                           BANKMASK(DAC5REFH), 0
#define DAC5R9                           BANKMASK(DAC5REFH), 1
#define DAC5REF0                         BANKMASK(DAC5REFL), 0
#define DAC5REF1                         BANKMASK(DAC5REFL), 1
#define DAC5REF10                        BANKMASK(DAC5REFH), 2
#define DAC5REF11                        BANKMASK(DAC5REFH), 3
#define DAC5REF12                        BANKMASK(DAC5REFH), 4
#define DAC5REF13                        BANKMASK(DAC5REFH), 5
#define DAC5REF14                        BANKMASK(DAC5REFH), 6
#define DAC5REF15                        BANKMASK(DAC5REFH), 7
#define DAC5REF2                         BANKMASK(DAC5REFL), 2
#define DAC5REF3                         BANKMASK(DAC5REFL), 3
#define DAC5REF4                         BANKMASK(DAC5REFL), 4
#define DAC5REF5                         BANKMASK(DAC5REFL), 5
#define DAC5REF6                         BANKMASK(DAC5REFL), 6
#define DAC5REF7                         BANKMASK(DAC5REFL), 7
#define DAC5REF8                         BANKMASK(DAC5REFH), 0
#define DAC5REF9                         BANKMASK(DAC5REFH), 1
#define DAC7EN                           BANKMASK(DAC7CON0), 7
#define DAC7NSS0                         BANKMASK(DAC7CON0), 0
#define DAC7NSS1                         BANKMASK(DAC7CON0), 1
#define DAC7OE1                          BANKMASK(DAC7CON0), 5
#define DAC7OE2                          BANKMASK(DAC7CON0), 4
#define DAC7PSS0                         BANKMASK(DAC7CON0), 2
#define DAC7PSS1                         BANKMASK(DAC7CON0), 3
#define DAC7R0                           BANKMASK(DAC7REF), 0
#define DAC7R1                           BANKMASK(DAC7REF), 1
#define DAC7R2                           BANKMASK(DAC7REF), 2
#define DAC7R3                           BANKMASK(DAC7REF), 3
#define DAC7R4                           BANKMASK(DAC7REF), 4
#define DAC7REF0                         BANKMASK(DAC7REF), 0
#define DAC7REF1                         BANKMASK(DAC7REF), 1
#define DAC7REF2                         BANKMASK(DAC7REF), 2
#define DAC7REF3                         BANKMASK(DAC7REF), 3
#define DAC7REF4                         BANKMASK(DAC7REF), 4
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define D_nA                             BANKMASK(SSP1STAT), 5
#define FERR                             BANKMASK(RC1STA), 2
#define FREE                             BANKMASK(PMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1ARSEN                          BANKMASK(COG1ASD0), 6
#define G1AS0E                           BANKMASK(COG1ASD1), 0
#define G1AS1E                           BANKMASK(COG1ASD1), 1
#define G1AS2E                           BANKMASK(COG1ASD1), 2
#define G1AS3E                           BANKMASK(COG1ASD1), 3
#define G1AS4E                           BANKMASK(COG1ASD1), 4
#define G1AS5E                           BANKMASK(COG1ASD1), 5
#define G1AS6E                           BANKMASK(COG1ASD1), 6
#define G1AS7E                           BANKMASK(COG1ASD1), 7
#define G1ASDAC0                         BANKMASK(COG1ASD0), 2
#define G1ASDAC1                         BANKMASK(COG1ASD0), 3
#define G1ASDBD0                         BANKMASK(COG1ASD0), 4
#define G1ASDBD1                         BANKMASK(COG1ASD0), 5
#define G1ASE                            BANKMASK(COG1ASD0), 7
#define G1ASREN                          BANKMASK(COG1ASD0), 6
#define G1BLKF0                          BANKMASK(COG1BLKF), 0
#define G1BLKF1                          BANKMASK(COG1BLKF), 1
#define G1BLKF2                          BANKMASK(COG1BLKF), 2
#define G1BLKF3                          BANKMASK(COG1BLKF), 3
#define G1BLKF4                          BANKMASK(COG1BLKF), 4
#define G1BLKF5                          BANKMASK(COG1BLKF), 5
#define G1BLKR0                          BANKMASK(COG1BLKR), 0
#define G1BLKR1                          BANKMASK(COG1BLKR), 1
#define G1BLKR2                          BANKMASK(COG1BLKR), 2
#define G1BLKR3                          BANKMASK(COG1BLKR), 3
#define G1BLKR4                          BANKMASK(COG1BLKR), 4
#define G1BLKR5                          BANKMASK(COG1BLKR), 5
#define G1CS0                            BANKMASK(COG1CON0), 3
#define G1CS1                            BANKMASK(COG1CON0), 4
#define G1DBF0                           BANKMASK(COG1DBF), 0
#define G1DBF1                           BANKMASK(COG1DBF), 1
#define G1DBF2                           BANKMASK(COG1DBF), 2
#define G1DBF3                           BANKMASK(COG1DBF), 3
#define G1DBF4                           BANKMASK(COG1DBF), 4
#define G1DBF5                           BANKMASK(COG1DBF), 5
#define G1DBR0                           BANKMASK(COG1DBR), 0
#define G1DBR1                           BANKMASK(COG1DBR), 1
#define G1DBR2                           BANKMASK(COG1DBR), 2
#define G1DBR3                           BANKMASK(COG1DBR), 3
#define G1DBR4                           BANKMASK(COG1DBR), 4
#define G1DBR5                           BANKMASK(COG1DBR), 5
#define G1EN                             BANKMASK(COG1CON0), 7
#define G1FDBS                           BANKMASK(COG1CON1), 6
#define G1FIS0                           BANKMASK(COG1FIS0), 0
#define G1FIS1                           BANKMASK(COG1FIS0), 1
#define G1FIS10                          BANKMASK(COG1FIS1), 2
#define G1FIS11                          BANKMASK(COG1FIS1), 3
#define G1FIS12                          BANKMASK(COG1FIS1), 4
#define G1FIS13                          BANKMASK(COG1FIS1), 5
#define G1FIS14                          BANKMASK(COG1FIS1), 6
#define G1FIS15                          BANKMASK(COG1FIS1), 7
#define G1FIS2                           BANKMASK(COG1FIS0), 2
#define G1FIS3                           BANKMASK(COG1FIS0), 3
#define G1FIS4                           BANKMASK(COG1FIS0), 4
#define G1FIS5                           BANKMASK(COG1FIS0), 5
#define G1FIS6                           BANKMASK(COG1FIS0), 6
#define G1FIS7                           BANKMASK(COG1FIS0), 7
#define G1FIS8                           BANKMASK(COG1FIS1), 0
#define G1FIS9                           BANKMASK(COG1FIS1), 1
#define G1FSIM0                          BANKMASK(COG1FSIM0), 0
#define G1FSIM1                          BANKMASK(COG1FSIM0), 1
#define G1FSIM10                         BANKMASK(COG1FSIM1), 2
#define G1FSIM11                         BANKMASK(COG1FSIM1), 3
#define G1FSIM12                         BANKMASK(COG1FSIM1), 4
#define G1FSIM13                         BANKMASK(COG1FSIM1), 5
#define G1FSIM14                         BANKMASK(COG1FSIM1), 6
#define G1FSIM15                         BANKMASK(COG1FSIM1), 7
#define G1FSIM2                          BANKMASK(COG1FSIM0), 2
#define G1FSIM3                          BANKMASK(COG1FSIM0), 3
#define G1FSIM4                          BANKMASK(COG1FSIM0), 4
#define G1FSIM5                          BANKMASK(COG1FSIM0), 5
#define G1FSIM6                          BANKMASK(COG1FSIM0), 6
#define G1FSIM7                          BANKMASK(COG1FSIM0), 7
#define G1FSIM8                          BANKMASK(COG1FSIM1), 0
#define G1FSIM9                          BANKMASK(COG1FSIM1), 1
#define G1LD                             BANKMASK(COG1CON0), 6
#define G1MD0                            BANKMASK(COG1CON0), 0
#define G1MD1                            BANKMASK(COG1CON0), 1
#define G1MD2                            BANKMASK(COG1CON0), 2
#define G1PHF0                           BANKMASK(COG1PHF), 0
#define G1PHF1                           BANKMASK(COG1PHF), 1
#define G1PHF2                           BANKMASK(COG1PHF), 2
#define G1PHF3                           BANKMASK(COG1PHF), 3
#define G1PHF4                           BANKMASK(COG1PHF), 4
#define G1PHF5                           BANKMASK(COG1PHF), 5
#define G1PHR0                           BANKMASK(COG1PHR), 0
#define G1PHR1                           BANKMASK(COG1PHR), 1
#define G1PHR2                           BANKMASK(COG1PHR), 2
#define G1PHR3                           BANKMASK(COG1PHR), 3
#define G1PHR4                           BANKMASK(COG1PHR), 4
#define G1PHR5                           BANKMASK(COG1PHR), 5
#define G1POLA                           BANKMASK(COG1CON1), 0
#define G1POLB                           BANKMASK(COG1CON1), 1
#define G1POLC                           BANKMASK(COG1CON1), 2
#define G1POLD                           BANKMASK(COG1CON1), 3
#define G1RDBS                           BANKMASK(COG1CON1), 7
#define G1RIS0                           BANKMASK(COG1RIS0), 0
#define G1RIS1                           BANKMASK(COG1RIS0), 1
#define G1RIS10                          BANKMASK(COG1RIS1), 2
#define G1RIS11                          BANKMASK(COG1RIS1), 3
#define G1RIS12                          BANKMASK(COG1RIS1), 4
#define G1RIS13                          BANKMASK(COG1RIS1), 5
#define G1RIS14                          BANKMASK(COG1RIS1), 6
#define G1RIS15                          BANKMASK(COG1RIS1), 7
#define G1RIS2                           BANKMASK(COG1RIS0), 2
#define G1RIS3                           BANKMASK(COG1RIS0), 3
#define G1RIS4                           BANKMASK(COG1RIS0), 4
#define G1RIS5                           BANKMASK(COG1RIS0), 5
#define G1RIS6                           BANKMASK(COG1RIS0), 6
#define G1RIS7                           BANKMASK(COG1RIS0), 7
#define G1RIS8                           BANKMASK(COG1RIS1), 0
#define G1RIS9                           BANKMASK(COG1RIS1), 1
#define G1RSIM0                          BANKMASK(COG1RSIM0), 0
#define G1RSIM1                          BANKMASK(COG1RSIM0), 1
#define G1RSIM10                         BANKMASK(COG1RSIM1), 2
#define G1RSIM11                         BANKMASK(COG1RSIM1), 3
#define G1RSIM12                         BANKMASK(COG1RSIM1), 4
#define G1RSIM13                         BANKMASK(COG1RSIM1), 5
#define G1RSIM14                         BANKMASK(COG1RSIM1), 6
#define G1RSIM15                         BANKMASK(COG1RSIM1), 7
#define G1RSIM2                          BANKMASK(COG1RSIM0), 2
#define G1RSIM3                          BANKMASK(COG1RSIM0), 3
#define G1RSIM4                          BANKMASK(COG1RSIM0), 4
#define G1RSIM5                          BANKMASK(COG1RSIM0), 5
#define G1RSIM6                          BANKMASK(COG1RSIM0), 6
#define G1RSIM7                          BANKMASK(COG1RSIM0), 7
#define G1RSIM8                          BANKMASK(COG1RSIM1), 0
#define G1RSIM9                          BANKMASK(COG1RSIM1), 1
#define G1SDATA                          BANKMASK(COG1STR), 4
#define G1SDATB                          BANKMASK(COG1STR), 5
#define G1SDATC                          BANKMASK(COG1STR), 6
#define G1SDATD                          BANKMASK(COG1STR), 7
#define G1STRA                           BANKMASK(COG1STR), 0
#define G1STRB                           BANKMASK(COG1STR), 1
#define G1STRC                           BANKMASK(COG1STR), 2
#define G1STRD                           BANKMASK(COG1STR), 3
#define G2ARSEN                          BANKMASK(COG2ASD0), 6
#define G2AS0E                           BANKMASK(COG2ASD1), 0
#define G2AS1E                           BANKMASK(COG2ASD1), 1
#define G2AS2E                           BANKMASK(COG2ASD1), 2
#define G2AS3E                           BANKMASK(COG2ASD1), 3
#define G2AS4E                           BANKMASK(COG2ASD1), 4
#define G2AS5E                           BANKMASK(COG2ASD1), 5
#define G2AS6E                           BANKMASK(COG2ASD1), 6
#define G2AS7E                           BANKMASK(COG2ASD1), 7
#define G2ASDAC0                         BANKMASK(COG2ASD0), 2
#define G2ASDAC1                         BANKMASK(COG2ASD0), 3
#define G2ASDBD0                         BANKMASK(COG2ASD0), 4
#define G2ASDBD1                         BANKMASK(COG2ASD0), 5
#define G2ASE                            BANKMASK(COG2ASD0), 7
#define G2ASREN                          BANKMASK(COG2ASD0), 6
#define G2BLKF0                          BANKMASK(COG2BLKF), 0
#define G2BLKF1                          BANKMASK(COG2BLKF), 1
#define G2BLKF2                          BANKMASK(COG2BLKF), 2
#define G2BLKF3                          BANKMASK(COG2BLKF), 3
#define G2BLKF4                          BANKMASK(COG2BLKF), 4
#define G2BLKF5                          BANKMASK(COG2BLKF), 5
#define G2BLKR0                          BANKMASK(COG2BLKR), 0
#define G2BLKR1                          BANKMASK(COG2BLKR), 1
#define G2BLKR2                          BANKMASK(COG2BLKR), 2
#define G2BLKR3                          BANKMASK(COG2BLKR), 3
#define G2BLKR4                          BANKMASK(COG2BLKR), 4
#define G2BLKR5                          BANKMASK(COG2BLKR), 5
#define G2CS0                            BANKMASK(COG2CON0), 3
#define G2CS1                            BANKMASK(COG2CON0), 4
#define G2DBF0                           BANKMASK(COG2DBF), 0
#define G2DBF1                           BANKMASK(COG2DBF), 1
#define G2DBF2                           BANKMASK(COG2DBF), 2
#define G2DBF3                           BANKMASK(COG2DBF), 3
#define G2DBF4                           BANKMASK(COG2DBF), 4
#define G2DBF5                           BANKMASK(COG2DBF), 5
#define G2DBR0                           BANKMASK(COG2DBR), 0
#define G2DBR1                           BANKMASK(COG2DBR), 1
#define G2DBR2                           BANKMASK(COG2DBR), 2
#define G2DBR3                           BANKMASK(COG2DBR), 3
#define G2DBR4                           BANKMASK(COG2DBR), 4
#define G2DBR5                           BANKMASK(COG2DBR), 5
#define G2EN                             BANKMASK(COG2CON0), 7
#define G2FDBS                           BANKMASK(COG2CON1), 6
#define G2FIS0                           BANKMASK(COG2FIS0), 0
#define G2FIS1                           BANKMASK(COG2FIS0), 1
#define G2FIS10                          BANKMASK(COG2FIS1), 2
#define G2FIS11                          BANKMASK(COG2FIS1), 3
#define G2FIS12                          BANKMASK(COG2FIS1), 4
#define G2FIS13                          BANKMASK(COG2FIS1), 5
#define G2FIS14                          BANKMASK(COG2FIS1), 6
#define G2FIS15                          BANKMASK(COG2FIS1), 7
#define G2FIS2                           BANKMASK(COG2FIS0), 2
#define G2FIS3                           BANKMASK(COG2FIS0), 3
#define G2FIS4                           BANKMASK(COG2FIS0), 4
#define G2FIS5                           BANKMASK(COG2FIS0), 5
#define G2FIS6                           BANKMASK(COG2FIS0), 6
#define G2FIS7                           BANKMASK(COG2FIS0), 7
#define G2FIS8                           BANKMASK(COG2FIS1), 0
#define G2FIS9                           BANKMASK(COG2FIS1), 1
#define G2FSIM0                          BANKMASK(COG2FSIM0), 0
#define G2FSIM1                          BANKMASK(COG2FSIM0), 1
#define G2FSIM10                         BANKMASK(COG2FSIM1), 2
#define G2FSIM11                         BANKMASK(COG2FSIM1), 3
#define G2FSIM12                         BANKMASK(COG2FSIM1), 4
#define G2FSIM13                         BANKMASK(COG2FSIM1), 5
#define G2FSIM14                         BANKMASK(COG2FSIM1), 6
#define G2FSIM15                         BANKMASK(COG2FSIM1), 7
#define G2FSIM2                          BANKMASK(COG2FSIM0), 2
#define G2FSIM3                          BANKMASK(COG2FSIM0), 3
#define G2FSIM4                          BANKMASK(COG2FSIM0), 4
#define G2FSIM5                          BANKMASK(COG2FSIM0), 5
#define G2FSIM6                          BANKMASK(COG2FSIM0), 6
#define G2FSIM7                          BANKMASK(COG2FSIM0), 7
#define G2FSIM8                          BANKMASK(COG2FSIM1), 0
#define G2FSIM9                          BANKMASK(COG2FSIM1), 1
#define G2LD                             BANKMASK(COG2CON0), 6
#define G2MD0                            BANKMASK(COG2CON0), 0
#define G2MD1                            BANKMASK(COG2CON0), 1
#define G2MD2                            BANKMASK(COG2CON0), 2
#define G2PHF0                           BANKMASK(COG2PHF), 0
#define G2PHF1                           BANKMASK(COG2PHF), 1
#define G2PHF2                           BANKMASK(COG2PHF), 2
#define G2PHF3                           BANKMASK(COG2PHF), 3
#define G2PHF4                           BANKMASK(COG2PHF), 4
#define G2PHF5                           BANKMASK(COG2PHF), 5
#define G2PHR0                           BANKMASK(COG2PHR), 0
#define G2PHR1                           BANKMASK(COG2PHR), 1
#define G2PHR2                           BANKMASK(COG2PHR), 2
#define G2PHR3                           BANKMASK(COG2PHR), 3
#define G2PHR4                           BANKMASK(COG2PHR), 4
#define G2PHR5                           BANKMASK(COG2PHR), 5
#define G2POLA                           BANKMASK(COG2CON1), 0
#define G2POLB                           BANKMASK(COG2CON1), 1
#define G2POLC                           BANKMASK(COG2CON1), 2
#define G2POLD                           BANKMASK(COG2CON1), 3
#define G2RDBS                           BANKMASK(COG2CON1), 7
#define G2RIS0                           BANKMASK(COG2RIS0), 0
#define G2RIS1                           BANKMASK(COG2RIS0), 1
#define G2RIS10                          BANKMASK(COG2RIS1), 2
#define G2RIS11                          BANKMASK(COG2RIS1), 3
#define G2RIS12                          BANKMASK(COG2RIS1), 4
#define G2RIS13                          BANKMASK(COG2RIS1), 5
#define G2RIS14                          BANKMASK(COG2RIS1), 6
#define G2RIS15                          BANKMASK(COG2RIS1), 7
#define G2RIS2                           BANKMASK(COG2RIS0), 2
#define G2RIS3                           BANKMASK(COG2RIS0), 3
#define G2RIS4                           BANKMASK(COG2RIS0), 4
#define G2RIS5                           BANKMASK(COG2RIS0), 5
#define G2RIS6                           BANKMASK(COG2RIS0), 6
#define G2RIS7                           BANKMASK(COG2RIS0), 7
#define G2RIS8                           BANKMASK(COG2RIS1), 0
#define G2RIS9                           BANKMASK(COG2RIS1), 1
#define G2RSIM0                          BANKMASK(COG2RSIM0), 0
#define G2RSIM1                          BANKMASK(COG2RSIM0), 1
#define G2RSIM10                         BANKMASK(COG2RSIM1), 2
#define G2RSIM11                         BANKMASK(COG2RSIM1), 3
#define G2RSIM12                         BANKMASK(COG2RSIM1), 4
#define G2RSIM13                         BANKMASK(COG2RSIM1), 5
#define G2RSIM14                         BANKMASK(COG2RSIM1), 6
#define G2RSIM15                         BANKMASK(COG2RSIM1), 7
#define G2RSIM2                          BANKMASK(COG2RSIM0), 2
#define G2RSIM3                          BANKMASK(COG2RSIM0), 3
#define G2RSIM4                          BANKMASK(COG2RSIM0), 4
#define G2RSIM5                          BANKMASK(COG2RSIM0), 5
#define G2RSIM6                          BANKMASK(COG2RSIM0), 6
#define G2RSIM7                          BANKMASK(COG2RSIM0), 7
#define G2RSIM8                          BANKMASK(COG2RSIM1), 0
#define G2RSIM9                          BANKMASK(COG2RSIM1), 1
#define G2SDATA                          BANKMASK(COG2STR), 4
#define G2SDATB                          BANKMASK(COG2STR), 5
#define G2SDATC                          BANKMASK(COG2STR), 6
#define G2SDATD                          BANKMASK(COG2STR), 7
#define G2STRA                           BANKMASK(COG2STR), 0
#define G2STRB                           BANKMASK(COG2STR), 1
#define G2STRC                           BANKMASK(COG2STR), 2
#define G2STRD                           BANKMASK(COG2STR), 3
#define G3ARSEN                          BANKMASK(COG3ASD0), 6
#define G3AS0E                           BANKMASK(COG3ASD1), 0
#define G3AS1E                           BANKMASK(COG3ASD1), 1
#define G3AS2E                           BANKMASK(COG3ASD1), 2
#define G3AS3E                           BANKMASK(COG3ASD1), 3
#define G3AS4E                           BANKMASK(COG3ASD1), 4
#define G3AS5E                           BANKMASK(COG3ASD1), 5
#define G3AS6E                           BANKMASK(COG3ASD1), 6
#define G3AS7E                           BANKMASK(COG3ASD1), 7
#define G3ASDAC0                         BANKMASK(COG3ASD0), 2
#define G3ASDAC1                         BANKMASK(COG3ASD0), 3
#define G3ASDBD0                         BANKMASK(COG3ASD0), 4
#define G3ASDBD1                         BANKMASK(COG3ASD0), 5
#define G3ASE                            BANKMASK(COG3ASD0), 7
#define G3ASREN                          BANKMASK(COG3ASD0), 6
#define G3BLKF0                          BANKMASK(COG3BLKF), 0
#define G3BLKF1                          BANKMASK(COG3BLKF), 1
#define G3BLKF2                          BANKMASK(COG3BLKF), 2
#define G3BLKF3                          BANKMASK(COG3BLKF), 3
#define G3BLKF4                          BANKMASK(COG3BLKF), 4
#define G3BLKF5                          BANKMASK(COG3BLKF), 5
#define G3BLKR0                          BANKMASK(COG3BLKR), 0
#define G3BLKR1                          BANKMASK(COG3BLKR), 1
#define G3BLKR2                          BANKMASK(COG3BLKR), 2
#define G3BLKR3                          BANKMASK(COG3BLKR), 3
#define G3BLKR4                          BANKMASK(COG3BLKR), 4
#define G3BLKR5                          BANKMASK(COG3BLKR), 5
#define G3CS0                            BANKMASK(COG3CON0), 3
#define G3CS1                            BANKMASK(COG3CON0), 4
#define G3DBF0                           BANKMASK(COG3DBF), 0
#define G3DBF1                           BANKMASK(COG3DBF), 1
#define G3DBF2                           BANKMASK(COG3DBF), 2
#define G3DBF3                           BANKMASK(COG3DBF), 3
#define G3DBF4                           BANKMASK(COG3DBF), 4
#define G3DBF5                           BANKMASK(COG3DBF), 5
#define G3DBR0                           BANKMASK(COG3DBR), 0
#define G3DBR1                           BANKMASK(COG3DBR), 1
#define G3DBR2                           BANKMASK(COG3DBR), 2
#define G3DBR3                           BANKMASK(COG3DBR), 3
#define G3DBR4                           BANKMASK(COG3DBR), 4
#define G3DBR5                           BANKMASK(COG3DBR), 5
#define G3EN                             BANKMASK(COG3CON0), 7
#define G3FDBS                           BANKMASK(COG3CON1), 6
#define G3FIS0                           BANKMASK(COG3FIS0), 0
#define G3FIS1                           BANKMASK(COG3FIS0), 1
#define G3FIS11                          BANKMASK(COG3FIS1), 3
#define G3FIS12                          BANKMASK(COG3FIS1), 4
#define G3FIS13                          BANKMASK(COG3FIS1), 5
#define G3FIS14                          BANKMASK(COG3FIS1), 6
#define G3FIS15                          BANKMASK(COG3FIS1), 7
#define G3FIS2                           BANKMASK(COG3FIS0), 2
#define G3FIS3                           BANKMASK(COG3FIS0), 3
#define G3FIS4                           BANKMASK(COG3FIS0), 4
#define G3FIS5                           BANKMASK(COG3FIS0), 5
#define G3FIS6                           BANKMASK(COG3FIS0), 6
#define G3FIS7                           BANKMASK(COG3FIS0), 7
#define G3FIS9                           BANKMASK(COG3FIS1), 1
#define G3FSIM0                          BANKMASK(COG3FSIM0), 0
